courses/Distributed Systems/distributedSystems.org
#+TITLE: Distributed Systems
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

| These are notes on CSE138 course on distributed systems [fn:ytlink]

#+TOC: headlines 2

* Intro


#+BEGIN_QUOTE
A distributed system is one in which the failure of a computer you didn’t even know existed can render your own computer unusable.  
-- Leslie Lamport
 #+END_QUOTE


Definition of distributed systems: Partial failure + unbounded latency

Why to deal with this?
- to make things faster, using more computers
- to have more data than what it can fit on one machine
- reliability (by redundancy, replicas)
- throughput (by proximity)

** Network models

+ Synchronous: A synch network is one where there exists an ~n~ such that no messages take longer than ~n~ units of time to be delivered.
+ Asynchronous: An asynch network is one where there exists NO ~n~ such that no messages take longer than ~n~ units of time to be delivered.

We will focus on asych, as it is the most realistic. 



* Clocks

** Physical clocks: Monotonic vs time-of-day clocks.
+ Monotonic: always go forwads. Are meaningful only inside the machine (they are computed as milliseconds since you restarted the machine or something like that). Good for mesuring /durations/.
+ Time-of-day: Are normally synched agains NTP (network time protocol). Can jump forward and backwards. Not very good for mesuring durations. Better for timestamps. 


#+BEGIN_SRC
   __         __ 
  |m1| x=5   |m2| x=5 
   |           |
3pm| \________ |
   |    x++   \| x=6
   |           |
   |       3pm |
   |           |
   v           v 
#+END_SRC
[Example 1] Example where neither of these physical clocks are useful


As ~m1~ and ~m2~ have their clocks a little bit unsynchronized, if we asked them to take a snapshot at 3pm, then ~m1~ would have said ~x=5~ while ~m2~ would have said ~x=6~

** Logical clocks

Only measures the order of events. 

A->B : A happened before B

This means:
- A could have caused B
- B could not have caused B

Useful for debugging.

We say that:
+ Consistent with causality: ~A->B~ => Logical clock of ~A~ < Logical clock of ~B~
+ Characterizes causality: Logical clock of ~A~ < Logical clock of ~B~ => ~A->B~

*** Lamport diagrams

Spacetime diagrams

Given events ~A~ and ~B~, we say ~A->B~ (~A~ happens before ~B~) if 
1. ~A~ and ~B~ happens in the same process line with ~A~ before ~B~.
2. ~A~ is a send event and ~B~ is the corresponding recieve event.
3. if ~A->C~ and ~C->B~ then ~A->B~ (transitivity)

#+BEGIN_SRC
   __         __ 
  |m1|       |m2|
   |           |
 A |\_________ |
   |          \|
   |           | B
   |           |
 D |           | C
   v           v
#+END_SRC
[Example 2] 

In the example, we know
1. ~A->B~ due to 2.
2. ~B->C~ due to 1.
3. ~A->D~ due to 1.
4. ~A->C~ due to our first two items and 3.
5. Neither ~B->D~ or ~D->B~ are true. So we say ~B~ and ~D~ are concurrent: ~B||D~


**** Causal anomaly 


Alice sends the message "Bob smells" to both Bob and Carol. Bob receives it first and answers "Fuck you Alice" to both Alice and Carol. Carol receives "Fuck you Alice" first and then "Bob Smells"

#+BEGIN_SRC
           _____         ___                _____
          |Alice|       |Bob|              |Carol|
             |              |                 |
 "Bob smells"|------------->|                 |
             |\             |                 |
             | \            |                 |
             |  \           | "Fuck you       |
             |   \          |  Alice"         |
             |    \        /|\--------------->|
             |     \     _/ |                 |
             |      \---/-------------------->|  ??
             |         /    |                 |
             |        /     |                 |
             | <-----/      |                 |
             v              v                 v
#+END_SRC
[Example 3]

This is known as /causal anomality/.



** State and events

We can look at the event log and reconstruct state. Not the other way around.

#+BEGIN_SRC
      __         __ 
     |m1|       |m2| x=5 
      |            | A
"set x|---------   |
 to 6"|         \->| B  
      |            | x=6    
"set x|---------   |
 to 7"|         \->| C  
      |            | x=7    
      v            v
#+END_SRC
[Example 4]

| log             |
|----------------|
| A    ??         |
| B   set x to 6 |
| C   set x to 7 |


** Partial order

Is "~->~" relation a partial order. Almost. It lacks reflexivity. So it's an /irreflective partial order/ (also know as /strict partial order/).



