courses/Distributed Systems/distributedSystems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-30 Thu 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Distributed Systems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eugenia Simich" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Distributed Systems</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">These are notes on CSE138 course on distributed systems <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>
</tbody>
</table>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org15d575c">Intro</a>
<ul>
<li><a href="#org0bcc1c6">Network models</a></li>
</ul>
</li>
<li><a href="#org18396e2">Clocks</a>
<ul>
<li><a href="#org78ba821">Physical clocks: Monotonic vs time-of-day clocks.</a></li>
<li><a href="#orgbda7660">Logical clocks</a></li>
<li><a href="#org21ed892">State and events</a></li>
<li><a href="#orgbcabfe5">Partial order</a></li>
<li><a href="#orgc9619c8">Lamport clocks</a></li>
<li><a href="#org500641e">Vector clocks</a></li>
</ul>
</li>
<li><a href="#orgc92883c">Delivery</a>
<ul>
<li><a href="#org94cd1b5">FIFO delivery</a></li>
<li><a href="#orgd275ee7">Causal delivery</a></li>
<li><a href="#orgefca8e9">Totally-ordered delivery</a></li>
<li><a href="#orgb35c2c5">Relation between the three delivery guarantees</a></li>
</ul>
</li>
<li><a href="#org524b7aa">Snapshots of distributed system</a></li>
<li><a href="#org5a1911a">Fault models</a>
<ul>
<li><a href="#orgf83486a">Safety and liveness</a></li>
<li><a href="#org36d4496">Faults models</a></li>
<li><a href="#org234df1e">Two generals problem</a></li>
<li><a href="#org900cada">Forms of fault tolerance</a></li>
</ul>
</li>
<li><a href="#org3a8617b">Replication</a>
<ul>
<li><a href="#org8ff9e84">Consistency models</a></li>
</ul>
</li>
<li><a href="#org01906d8">Consensus</a>
<ul>
<li><a href="#org6b20f1c">Paxos</a></li>
</ul>
</li>
<li><a href="#orgc92151d">Dynamo style DBs</a>
<ul>
<li><a href="#org44064c2">Passive vs Active replication</a></li>
<li><a href="#org7dc62a0">CAP</a></li>
<li><a href="#org4daceb2">Eventual consistency and strong convergence</a></li>
<li><a href="#orgbc56626">Dealing with replicas that disagree</a></li>
<li><a href="#orgc1577a8">Quorum consistency</a></li>
<li><a href="#org5e3fa57">Tail latency</a></li>
</ul>
</li>
<li><a href="#org1494cf2">Sharding</a></li>
<li><a href="#orgd5d1787">MapReduce</a></li>
</ul>
</div>
</div>

<div id="outline-container-org15d575c" class="outline-2">
<h2 id="org15d575c">Intro</h2>
<div class="outline-text-2" id="text-org15d575c">
<blockquote>
<p>
A distributed system is one in which the failure of a computer you didn’t even know existed can render your own computer unusable.  
&#x2013; Leslie Lamport
</p>
</blockquote>


<p>
Definition of distributed systems: Partial failure + unbounded latency
</p>

<p>
Why to deal with this?
</p>
<ul class="org-ul">
<li>to make things faster, using more computers</li>
<li>to have more data than what it can fit on one machine</li>
<li>reliability (by redundancy, replicas)</li>
<li>throughput (by proximity)</li>
</ul>
</div>

<div id="outline-container-org0bcc1c6" class="outline-3">
<h3 id="org0bcc1c6">Network models</h3>
<div class="outline-text-3" id="text-org0bcc1c6">
<ul class="org-ul">
<li>Synchronous: A synch network is one where there exists an <code>n</code> such that no messages take longer than <code>n</code> units of time to be delivered.</li>
<li>Asynchronous: An asynch network is one where there exists NO <code>n</code> such that no messages take longer than <code>n</code> units of time to be delivered.</li>
</ul>

<p>
We will focus on asych, as it is the most realistic. 
</p>
</div>
</div>
</div>



<div id="outline-container-org18396e2" class="outline-2">
<h2 id="org18396e2">Clocks</h2>
<div class="outline-text-2" id="text-org18396e2">
</div>
<div id="outline-container-org78ba821" class="outline-3">
<h3 id="org78ba821">Physical clocks: Monotonic vs time-of-day clocks.</h3>
<div class="outline-text-3" id="text-org78ba821">
<ul class="org-ul">
<li>Monotonic: always go forwads. Are meaningful only inside the machine (they are computed as milliseconds since you restarted the machine or something like that). Good for mesuring <i>durations</i>.</li>
<li>Time-of-day: Are normally synched agains NTP (network time protocol). Can jump forward and backwards. Not very good for mesuring durations. Better for timestamps.</li>
</ul>


<pre class="example">
   __         __ 
  |m1| x=5   |m2| x=5 
   |           |
3pm| \________ |
   |    x++   \| x=6
   |           |
   |       3pm |
   |           |
   v           v 
</pre>
<p>
[Example 1] Example where neither of these physical clocks are useful
</p>


<p>
As <code>m1</code> and <code>m2</code> have their clocks a little bit unsynchronized, if we asked them to take a snapshot at 3pm, then <code>m1</code> would have said <code>x=5</code> while <code>m2</code> would have said <code>x=6</code>
</p>
</div>
</div>

<div id="outline-container-orgbda7660" class="outline-3">
<h3 id="orgbda7660">Logical clocks</h3>
<div class="outline-text-3" id="text-orgbda7660">
<p>
Only measures the order of events. 
</p>

<p>
A-&gt;B : A happened before B
</p>

<p>
This means:
</p>
<ul class="org-ul">
<li>A could have caused B</li>
<li>B could not have caused B</li>
</ul>

<p>
Useful for debugging.
</p>

<p>
We say that:
</p>
<ul class="org-ul">
<li>Consistent with causality: <code>A-&gt;B</code> =&gt; Logical clock of <code>A</code> &lt; Logical clock of <code>B</code></li>
<li>Characterizes causality: Logical clock of <code>A</code> &lt; Logical clock of <code>B</code> =&gt; <code>A-&gt;B</code></li>
</ul>
</div>

<div id="outline-container-orgfedcc60" class="outline-4">
<h4 id="orgfedcc60">Lamport diagrams</h4>
<div class="outline-text-4" id="text-orgfedcc60">
<p>
Spacetime diagrams
</p>

<p>
Given events <code>A</code> and <code>B</code>, we say <code>A-&gt;B</code> (<code>A</code> happens before <code>B</code>) if 
</p>
<ol class="org-ol">
<li><code>A</code> and <code>B</code> happens in the same process line with <code>A</code> before <code>B</code>.</li>
<li><code>A</code> is a send event and <code>B</code> is the corresponding recieve event.</li>
<li>if <code>A-&gt;C</code> and <code>C-&gt;B</code> then <code>A-&gt;B</code> (transitivity)</li>
</ol>

<pre class="example">
  __         __ 
 |m1|       |m2|
  |           |
A |\_________ |
  |          \|
  |           | B
  |           |
D |           | C
  v           v
</pre>
<p>
[Example 2] 
</p>

<p>
In the example, we know
</p>
<ol class="org-ol">
<li><code>A-&gt;B</code> due to 2.</li>
<li><code>B-&gt;C</code> due to 1.</li>
<li><code>A-&gt;D</code> due to 1.</li>
<li><code>A-&gt;C</code> due to our first two items and 3.</li>
<li>Neither <code>B-&gt;D</code> or <code>D-&gt;B</code> are true. So we say <code>B</code> and <code>D</code> are concurrent: <code>B||D</code></li>
</ol>
</div>


<ul class="org-ul">
<li><a id="org02e6fa7"></a>Causal anomaly<br />
<div class="outline-text-5" id="text-org02e6fa7">
<p>
Alice sends the message "Bob smells" to both Bob and Carol. Bob receives it first and answers "Fuck you Alice" to both Alice and Carol. Carol receives "Fuck you Alice" first and then "Bob Smells"
</p>

<pre class="example">
	  _____         ___                _____
	 |Alice|       |Bob|              |Carol|
	    |              |                 |
"Bob smells"|-------------&gt;|                 |
	    |\             |                 |
	    | \            |                 |
	    |  \           | "Fuck you       |
	    |   \          |  Alice"         |
	    |    \        /|\---------------&gt;|
	    |     \     _/ |                 |
	    |      \---/--------------------&gt;|  ??
	    |         /    |                 |
	    |        /     |                 |
	    | &lt;-----/      |                 |
	    v              v                 v
</pre>
<p>
[Example 3]
</p>

<p>
This is known as <i>causal anomality</i>.
</p>
</div>
</li>
</ul>
</div>
</div>



<div id="outline-container-org21ed892" class="outline-3">
<h3 id="org21ed892">State and events</h3>
<div class="outline-text-3" id="text-org21ed892">
<p>
We can look at the event log and reconstruct state. Not the other way around.
</p>

<pre class="example">
      __         __ 
     |m1|       |m2| x=5 
      |            | A
"set x|---------   |
 to 6"|         \-&gt;| B  
      |            | x=6    
"set x|---------   |
 to 7"|         \-&gt;| C  
      |            | x=7    
      v            v
</pre>
<p>
[Example 4]
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">log</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A    ??</td>
</tr>

<tr>
<td class="org-left">B   set x to 6</td>
</tr>

<tr>
<td class="org-left">C   set x to 7</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgbcabfe5" class="outline-3">
<h3 id="orgbcabfe5">Partial order</h3>
<div class="outline-text-3" id="text-orgbcabfe5">
<p>
Is "<code>-&gt;</code>" relation a partial order. Almost. It lacks reflexivity. So it's an <i>irreflective partial order</i> (also know as <i>strict partial order</i>).
</p>
</div>
</div>
