courses/Distributed Systems/distributedSystems.org
** Lamport clocks

The lamport clock of an event ~A~ (written ~LC(A)~

"clock condition": if ~A->B~ then ~LC(A) < LC(B)~ (consistent with causality)

Lamport clock algoritm:

1) Every process keeps a counter
2) On each event on a process, the counter is incremented. 
3) When sending a message, the sender includes it's counter in the message.
4) When receiveing a message, the receiver sets its counter to be ~max(local_counter, received_counter) + 1~

We can note that following these rules, ~LC(A)<LC(B)~ does not imply ~A->B~ so lamport clocks are consistent with causality but do not characterize causality.

But, by contrapositive: ~!(LC(A)<LC(B)) => ! A->B~, in other words ~LC(A) >= LC(B) =>  A||B~

There's a logical clock with both characteristics..

** Vector clocks

1) Every process keeps a vector of integers initialized at 0s. This vector has dimension ~n~, for ~n~ processes.
2) On every event, a process increments its position in its vector clock.
3) When sending a message, the sender includes its vector clock in the message (after the increment from step 2., because sends are events.)
4) When receiving a message, the receiver will update its vector clock to ~max(local_vector, received_vector)~ and increment its own position, because receive is an event. We define ~max~ to be the pointwise max.



#+BEGIN_SRC 
           _____           ___                _____
          |Alice|         |Bob|              |Carol|
    [0,0,0]  |       [0,0,0]  |         [0,0,0] |
             |                |                 |
             |                |                 |
             |                |     ----------- + [0,0,1]
             |        [0,1,1] +<---/            |
             |                |                 |
             |     -----------+ [0,2,1]         |
    [1,2,1]  +<---/           |                 |
             |                |                 |             
             |        [0,3,1] +\-------------   |
             |                |              \->+ [0,3,2]
             |                |                 |
    [2,2,1]  +-------------   |                 |
             |             \->+ [2,4,1]         |
             |                |                 + [0,3,3]
             |                +- [2,5,1]       /|
             |                | \__________   / |
             |                |            \-/->+ [2,5,4] 
             |                |             /   |
    [3,3,3]  +<----------------------------/    |
             |                |              __/+ [2,5,5] 
    [4,5,5]  +<-----------------------------/   |
             |                |                 |
             v                v                 v
#+END_SRC
[Example 5]

Each event has a /logical clock/ assigned, a /vector clock/. 

An there's a characteristic that we can notice:  ~A->B <=> VC(A) < VC(B)~

Given any event, there's a set of events whose vector clocks are /smaller/, some events whose vector clocks are /higher/, using point-wise comparision. There are also events not comparable using this comparison function.

For example, if we pick event ~[2,4,1]~, there is a set of events that have smaller vector clocks (~[0,0,1]~, ~[0,1,1]~, ect)
and some that are higher (~[2,5,5]~, ~[2,5,4]~, etc) and some not comparable (~[0,3,3]~, ~[3,3,3]~, etc)

Events whose vector clocks are not comparable, are concurrent, /causally independent/.

If we want to know the /happen-before/ relashionship, we can just compare vectors.


+ Protocol :: Set of rules that processes use to communicate to each other. 

* Delivery

** FIFO delivery

Ensures that the order in which messages are sent by a process is the same as the order in which they are delivered by other processes.

+ FIFO delivery :: If a process sends message ~m2~ after message ~m1~, any process delivering both, delivers ~m1~ first.

Sending: Something a process DO.
Receiving: Something that HAPPENS to a process .
Delivering: Something a process CAN DO with a message it receives. (Messages can be queued up and deliver posponed)

#+BEGIN_SRC
   __          __ 
  |A|          |B|
   |            |
   |\___m1_     |
   |-------\--->|
   |  m2    \   | 
   |         \->|
   |            | 
   v            v
#+END_SRC
[Example 6] 

/Example 6 violates FIFO delivery/

| FIFO delivery is already part of TCP

FIFO delivery can be implemented with sequence numbers: Messages are tagged with ~(senderID, sequenceNbr)~

Senders increment the sequence number after each send. If a received message has a SN equal to previously seen SN plus one, then deliver.

FIFO delivery only works well if /reliable delivery is guaranteed/. (TCP has both)



#+BEGIN_SRC
   __          __ 
  |A|          |B|
   |            |
   |\___m1_     |
   |       \--->|
   |            |
   |  ack   ----|
   |<------/    |
   |            |
   |\___m2_     |
   |       \--->|
   |            |
   |  ack   ----|
   |<------/    |
   v            v
#+END_SRC
[Example 7] 

A way of ensuring FIFO. Of couse this is slower.

** Causal delivery

 Ensures that messages with a causal relationship (i.e., one message happens before another) are delivered in the same order as they were sent.

+ Causal delivery :: If ~m1~'s send happens before ~ms~'s send, then ~m1~'s delivery must happen before ~m2~'s delivery.

/Example 6 of FIFO delivery violation, also violates causal delivery./

/Example 3 (Bob smells, FU Alice) violates causal delivery but not FIFO delivery/. Why? Because FIFO is about messages being sent /from the same sender/.

We can enforce causal delivery by using vector clocks

