courses/Distributed Systems/distributedSystems.html



<div id="outline-container-orgc9619c8" class="outline-3">
<h3 id="orgc9619c8">Lamport clocks</h3>
<div class="outline-text-3" id="text-orgc9619c8">
<p>
The lamport clock of an event <code>A</code> (written <code>LC(A)</code>
</p>

<p>
"clock condition": if <code>A-&gt;B</code> then <code>LC(A) &lt; LC(B)</code> (consistent with causality)
</p>

<p>
Lamport clock algoritm:
</p>

<ol class="org-ol">
<li>Every process keeps a counter</li>
<li>On each event on a process, the counter is incremented.</li>
<li>When sending a message, the sender includes it's counter in the message.</li>
<li>When receiveing a message, the receiver sets its counter to be <code>max(local_counter, received_counter) + 1</code></li>
</ol>

<p>
We can note that following these rules, <code>LC(A)&lt;LC(B)</code> does not imply <code>A-&gt;B</code> so lamport clocks are consistent with causality but do not characterize causality.
</p>

<p>
But, by contrapositive: <code>!(LC(A)&lt;LC(B)) =&gt; ! A-&gt;B</code>, in other words <code>LC(A) &gt;= LC(B) =&gt;  A||B</code>
</p>

<p>
There's a logical clock with both characteristics..
</p>
</div>
</div>

<div id="outline-container-org500641e" class="outline-3">
<h3 id="org500641e">Vector clocks</h3>
<div class="outline-text-3" id="text-org500641e">
<ol class="org-ol">
<li>Every process keeps a vector of integers initialized at 0s. This vector has dimension <code>n</code>, for <code>n</code> processes.</li>
<li>On every event, a process increments its position in its vector clock.</li>
<li>When sending a message, the sender includes its vector clock in the message (after the increment from step 2., because sends are events.)</li>
<li>When receiving a message, the receiver will update its vector clock to <code>max(local_vector, received_vector)</code> and increment its own position, because receive is an event. We define <code>max</code> to be the pointwise max.</li>
</ol>



<pre class="example">
       _____           ___                _____
      |Alice|         |Bob|              |Carol|
[0,0,0]  |       [0,0,0]  |         [0,0,0] |
	 |                |                 |
	 |                |                 |
	 |                |     ----------- + [0,0,1]
	 |        [0,1,1] +&lt;---/            |
	 |                |                 |
	 |     -----------+ [0,2,1]         |
[1,2,1]  +&lt;---/           |                 |
	 |                |                 |             
	 |        [0,3,1] +\-------------   |
	 |                |              \-&gt;+ [0,3,2]
	 |                |                 |
[2,2,1]  +-------------   |                 |
	 |             \-&gt;+ [2,4,1]         |
	 |                |                 + [0,3,3]
	 |                +- [2,5,1]       /|
	 |                | \__________   / |
	 |                |            \-/-&gt;+ [2,5,4] 
	 |                |             /   |
[3,3,3]  +&lt;----------------------------/    |
	 |                |              __/+ [2,5,5] 
[4,5,5]  +&lt;-----------------------------/   |
	 |                |                 |
	 v                v                 v
</pre>
<p>
[Example 5]
</p>

<p>
Each event has a <i>logical clock</i> assigned, a <i>vector clock</i>. 
</p>

<p>
An there's a characteristic that we can notice:  <code>A-&gt;B &lt;=&gt; VC(A) &lt; VC(B)</code>
</p>

<p>
Given any event, there's a set of events whose vector clocks are <i>smaller</i>, some events whose vector clocks are <i>higher</i>, using point-wise comparision. There are also events not comparable using this comparison function.
</p>

<p>
For example, if we pick event <code>[2,4,1]</code>, there is a set of events that have smaller vector clocks (<code>[0,0,1]</code>, <code>[0,1,1]</code>, ect)
and some that are higher (<code>[2,5,5]</code>, <code>[2,5,4]</code>, etc) and some not comparable (<code>[0,3,3]</code>, <code>[3,3,3]</code>, etc)
</p>

<p>
Events whose vector clocks are not comparable, are concurrent, <i>causally independent</i>.
</p>

<p>
If we want to know the <i>happen-before</i> relashionship, we can just compare vectors.
</p>


<dl class="org-dl">
<dt>Protocol</dt><dd>Set of rules that processes use to communicate to each other.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgc92883c" class="outline-2">
<h2 id="orgc92883c">Delivery</h2>
<div class="outline-text-2" id="text-orgc92883c">
</div>
<div id="outline-container-org94cd1b5" class="outline-3">
<h3 id="org94cd1b5">FIFO delivery</h3>
<div class="outline-text-3" id="text-org94cd1b5">
<p>
Ensures that the order in which messages are sent by a process is the same as the order in which they are delivered by other processes.
</p>

<dl class="org-dl">
<dt>FIFO delivery</dt><dd>If a process sends message <code>m2</code> after message <code>m1</code>, any process delivering both, delivers <code>m1</code> first.</dd>
</dl>

<p>
Sending: Something a process DO.
Receiving: Something that HAPPENS to a process .
Delivering: Something a process CAN DO with a message it receives. (Messages can be queued up and deliver posponed)
</p>

<pre class="example">
 __          __ 
|A|          |B|
 |            |
 |\___m1_     |
 |-------\---&gt;|
 |  m2    \   | 
 |         \-&gt;|
 |            | 
 v            v
</pre>
<p>
[Example 6] 
</p>

<p>
<i>Example 6 violates FIFO delivery</i>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">FIFO delivery is already part of TCP</td>
</tr>
</tbody>
</table>

<p>
FIFO delivery can be implemented with sequence numbers: Messages are tagged with <code>(senderID, sequenceNbr)</code>
</p>

<p>
Senders increment the sequence number after each send. If a received message has a SN equal to previously seen SN plus one, then deliver.
</p>

<p>
FIFO delivery only works well if <i>reliable delivery is guaranteed</i>. (TCP has both)
</p>



<pre class="example">
 __          __ 
|A|          |B|
 |            |
 |\___m1_     |
 |       \---&gt;|
 |            |
 |  ack   ----|
 |&lt;------/    |
 |            |
 |\___m2_     |
 |       \---&gt;|
 |            |
 |  ack   ----|
 |&lt;------/    |
 v            v
</pre>
<p>
[Example 7] 
</p>

<p>
A way of ensuring FIFO. Of couse this is slower.
</p>
</div>
</div>

<div id="outline-container-orgd275ee7" class="outline-3">
<h3 id="orgd275ee7">Causal delivery</h3>
<div class="outline-text-3" id="text-orgd275ee7">
<p>
Ensures that messages with a causal relationship (i.e., one message happens before another) are delivered in the same order as they were sent.
</p>

<dl class="org-dl">
<dt>Causal delivery</dt><dd>If <code>m1</code>'s send happens before <code>ms</code>'s send, then <code>m1</code>'s delivery must happen before <code>m2</code>'s delivery.</dd>
</dl>

<p>
<i>Example 6 of FIFO delivery violation, also violates causal delivery.</i>
</p>

<p>
<i>Example 3 (Bob smells, FU Alice) violates causal delivery but not FIFO delivery</i>. Why? Because FIFO is about messages being sent <i>from the same sender</i>.
</p>

<p>
We can enforce causal delivery by using vector clocks
</p>
</div>
