courses/Distributed Systems/distributedSystems.org
*** Causal broadcast

Causal broadcast is an algorithm that ensures causal delivery in a setting where all messages are broadcast messages.

We want to define a deliverability condition that will indicate whether a message has to be delivere or not upon receival.

The algorithm chosen is vector clock (with no receive increase). The deliverability condition will be tied to the vector contained in the message metaata. A message ~m~ is deliverable at a process ~p~ if


\begin{align*}               
VC(m)[k] &= VC(p)[k] + 1 & \mbox{ if $k$ is the sender} \\
VC(m)[k] &\leq VC(p)[k]     & \mbox{ otherwise}
\end{align*}

Where \(VC(m)\) is the vector clock comming the message, an \(VC(p)\) is the vector clock currently stored in the process.

Let's observe this in the example 3, but using vector clocks

#+BEGIN_SRC
             _             _                  _
            |A|           |B|                |C|
     [0,0,0] |      [0,0,0] |         [0,0,0] |
             |              |                 |
     [1,0,0] |------------->| [1,0,0]         |
             |\             |                 |
             | \            |                 |
             |  \           |                 |
             |   \          |  [1,1,0]        |
             |    \        /|\--------------->| X
             |     \     _/ |                 |
             |      \---/-------------------->| Y 
             |         /    |    [1,0,0]      |
             |        /     |                 |
             | <-----/      |                 |
             v              v                 v
#+END_SRC
[Example 8]

At point ~X~, process ~C~ receives the vector clock ~[1,1,0]~. It's own vector clock, at this point is ~[0,0,0]~, so 
the second condition is violated. \(VC(m)[0] = 1 \nleq 0\). So ~C~ shouldn't deliver the first message. Instead, it can be queued.

At point ~Y~, process ~C~ receives the vector clock ~[1,0,0]~. In this case both conditions are met and the message can be delivered. ~c~'s vector clock now changes to be ~[1,0,0]~. So now the message queued can also be delivered.



** Totally-ordered delivery

Ensures that messages are delivered in the same order on all processes. 

+ Totally-ordered delivery :: If a proccess /delivers/ ~m1~ and then ~m2~, then all processes /delivering/ both should deliver ~m1~ first.

#+BEGIN_SRC
   _            _          _            _
  |A|          |B|        |C|          |D|
   |            |          |            |
   |____m1_     |          |      _m2___|
   |  \    \--->|          |<----/    / |
   |   \        |     m1   |         /  |
   |    \----------------->|        /   |
   |            |          |    m2 /    |
   |            |<----------------/     |
   |            |          |            |
   v            v          v            v
#+END_SRC
[Example 9] 

~B~ delivers ~m1~ first and then ~m2~, ~C~ delivers ~m2~ first and then ~m1~. So there's a violation of totally-ordered delivery.

Use case scenario: Imagine ~B~ and ~C~ being replicas of a data base.


** Relation between the three delivery guarantees

#+begin_src 
┌─All──────────────────────┐
│  ┌──FIFO─────────┐       │
│  │               │       │
│  │    Causal─┐   │       │
│  │   │       │   │       │
│  │   │    ┌──┼───┼─────┐ │
│  │   └────┼──┘   │     │ │
│  │        │      │     │ │
│  └────────┼──────┘     │ │
│           │            │ │
│           └────────T.O.  │
└──────────────────────────┘
#+end_src

This means that 
+ There are executions with both causal and totally ordered delivery.
+ There are executions with both FIFO and totally ordered delivery, but not causal.
+ There are executions with totally ordered delivery buta not FIFO.


* Snapshots of distributed system

Taking a snapshot at certain point in time, using wall clock time, is not safe.

If we have two events ~A~ and ~B~, and ~A~ happens-before ~B~, if ~B~ is in the snapshot, then ~A~ also.

We do need snapshots for:
 + Checkpointing
 + Deadlock detection
 + Detection of any stable property (one it becomes true, it stays true)

