courses/Distributed Systems/distributedSystems.html

<div id="outline-container-org335afc4" class="outline-4">
<h4 id="org335afc4">Causal broadcast</h4>
<div class="outline-text-4" id="text-org335afc4">
<p>
Causal broadcast is an algorithm that ensures causal delivery in a setting where all messages are broadcast messages.
</p>

<p>
We want to define a deliverability condition that will indicate whether a message has to be delivere or not upon receival.
</p>

<p>
The algorithm chosen is vector clock (with no receive increase). The deliverability condition will be tied to the vector contained in the message metaata. A message <code>m</code> is deliverable at a process <code>p</code> if
</p>


\begin{align*}               
VC(m)[k] &= VC(p)[k] + 1 & \mbox{ if $k$ is the sender} \\
VC(m)[k] &\leq VC(p)[k]     & \mbox{ otherwise}
\end{align*}

<p>
Where \(VC(m)\) is the vector clock comming the message, an \(VC(p)\) is the vector clock currently stored in the process.
</p>

<p>
Let's observe this in the example 3, but using vector clocks
</p>

<pre class="example">
	_             _                  _
       |A|           |B|                |C|
[0,0,0] |      [0,0,0] |         [0,0,0] |
	|              |                 |
[1,0,0] |-------------&gt;| [1,0,0]         |
	|\             |                 |
	| \            |                 |
	|  \           |                 |
	|   \          |  [1,1,0]        |
	|    \        /|\---------------&gt;| X
	|     \     _/ |                 |
	|      \---/--------------------&gt;| Y 
	|         /    |    [1,0,0]      |
	|        /     |                 |
	| &lt;-----/      |                 |
	v              v                 v
</pre>
<p>
[Example 8]
</p>

<p>
At point <code>X</code>, process <code>C</code> receives the vector clock <code>[1,1,0]</code>. It's own vector clock, at this point is <code>[0,0,0]</code>, so 
the second condition is violated. \(VC(m)[0] = 1 \nleq 0\). So <code>C</code> shouldn't deliver the first message. Instead, it can be queued.
</p>

<p>
At point <code>Y</code>, process <code>C</code> receives the vector clock <code>[1,0,0]</code>. In this case both conditions are met and the message can be delivered. <code>c</code>'s vector clock now changes to be <code>[1,0,0]</code>. So now the message queued can also be delivered.
</p>
</div>
</div>
</div>



<div id="outline-container-orgefca8e9" class="outline-3">
<h3 id="orgefca8e9">Totally-ordered delivery</h3>
<div class="outline-text-3" id="text-orgefca8e9">
<p>
Ensures that messages are delivered in the same order on all processes. 
</p>

<dl class="org-dl">
<dt>Totally-ordered delivery</dt><dd>If a proccess <i>delivers</i> <code>m1</code> and then <code>m2</code>, then all processes <i>delivering</i> both should deliver <code>m1</code> first.</dd>
</dl>

<pre class="example">
 _            _          _            _
|A|          |B|        |C|          |D|
 |            |          |            |
 |____m1_     |          |      _m2___|
 |  \    \---&gt;|          |&lt;----/    / |
 |   \        |     m1   |         /  |
 |    \-----------------&gt;|        /   |
 |            |          |    m2 /    |
 |            |&lt;----------------/     |
 |            |          |            |
 v            v          v            v
</pre>
<p>
[Example 9] 
</p>

<p>
<code>B</code> delivers <code>m1</code> first and then <code>m2</code>, <code>C</code> delivers <code>m2</code> first and then <code>m1</code>. So there's a violation of totally-ordered delivery.
</p>

<p>
Use case scenario: Imagine <code>B</code> and <code>C</code> being replicas of a data base.
</p>
</div>
</div>


<div id="outline-container-orgb35c2c5" class="outline-3">
<h3 id="orgb35c2c5">Relation between the three delivery guarantees</h3>
<div class="outline-text-3" id="text-orgb35c2c5">
<pre class="example">
┌─All──────────────────────┐
│  ┌──FIFO─────────┐       │
│  │               │       │
│  │    Causal─┐   │       │
│  │   │       │   │       │
│  │   │    ┌──┼───┼─────┐ │
│  │   └────┼──┘   │     │ │
│  │        │      │     │ │
│  └────────┼──────┘     │ │
│           │            │ │
│           └────────T.O.  │
└──────────────────────────┘
</pre>

<p>
This means that 
</p>
<ul class="org-ul">
<li>There are executions with both causal and totally ordered delivery.</li>
<li>There are executions with both FIFO and totally ordered delivery, but not causal.</li>
<li>There are executions with totally ordered delivery buta not FIFO.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org524b7aa" class="outline-2">
<h2 id="org524b7aa">Snapshots of distributed system</h2>
<div class="outline-text-2" id="text-org524b7aa">
<p>
Taking a snapshot at certain point in time, using wall clock time, is not safe.
</p>

<p>
If we have two events <code>A</code> and <code>B</code>, and <code>A</code> happens-before <code>B</code>, if <code>B</code> is in the snapshot, then <code>A</code> also.
</p>

<p>
We do need snapshots for:
</p>
<ul class="org-ul">
<li>Checkpointing</li>
<li>Deadlock detection</li>
<li>Detection of any stable property (one it becomes true, it stays true)</li>
</ul>
</div>

<ul class="org-ul">
