courses/Distributed Systems/distributedSystems.org
**** Chandy-Lamport algorithm (1985)

We will call /channel/ to a connection between two processes. Communication between two processes go through a channel. We introduce this notion to ensure FIFO ordering. This algorithm also assumes that messages aren't lost, corrupted or duplicated. Also assumes processes don't crash.

/Initiator/: 
1. Records its own state. 
2. Sends a marker message out on all its outgoing channels.
3. Starts recording the messages it receives in all its incoming channels.

/When process p_i receives a marker message on C_{ki}/:
+ If it's the first marker it has seen (sent or received)
  1. p_i records its state
  2. p_i will mark channel C_{ki} as empty
  3. p_i sends a marker in all its outgoing channels
  4. p_i starts recording in all its incomming channels
+ Otherwise
  1. p_i stops recording on C_{ki}

Let's look at the following example[fn:chandy-lamport], where process ~P1~ is the snapshot initiator.

#+BEGIN_SRC
C21= [H->D]   C12= <>   C13= <>
C31= <>       C32= <>   C23= <>

   __           __          __      
  |P1|         |P2|        |P3|    
   |            |            |            
 A +            |            |
   |            |       -----+ I            
 B +_______     |      /     |     
   |       \--->+ F   /      |
   |===         |    /       |
   |  \\====================>|
   |   \\       |  /         |
   |    \\    G +<-          |    
   |     \\     |            |
 C +      \\    |        ====|
   |       \\   |      //    |
   |        ||  |     //     + J
   |<===========|======      |
   |        ||  |     ||     |
   |     -------+ H   ||     |
   |    /   ||  |     ||     |
   |   /    ||  |<=====      |
 D +<-/     ||  |            |
   |     =======|===========>|
   |   //   ||  |            |
   |<===     \\ |            |
   |          =>|            |
   |            |            |            
   v            v            v            
#+END_SRC
[Example 10] 


1. First, ~P1~ records its own state, which consists of events ~A~ and ~B~. Then it trigers two marking events (in the example marking events are represented with double lines). The marker message headed to ~P2~ is taking a while. The marker message sent to ~P3~ arrives quickly. Let's follow from there.
2. When ~A~'s marker message arrives at ~P3~, this process has never seen a marker message so far, so ~P3~ records its state, which consists of only the event ~I~ and marks channel ~C13~ as empty. Then it broadcasts marker messages and starts recording on all its incoming channels (~C23~).
3. ~P3~ has sent out its marker messages. Let’s consider the one that went to ~P1~ first. This message is not the first marker message that ~P1~ has seen (it has seen its own marker messages), so it will stop recording on ~C31~. As nothing happened on that channel, it ends up being empty.
4. Let's look at the marker message that ~P3~ sent to ~P2~. As this is the first marker message that ~P2~ has seen, then it first records it state: ~F~, ~G~ and ~H~. Then it will mark channel ~C32~ as empty and start recording on all its incoming channels (only ~C12~, as ~C32~ was already marked as empty). ~P2~ also sends its marker messages.
5. ~P2~ marker messages will finally arrive to ~P1~ and ~P3~, that will lead to channels ~C21~ and ~C23~ recordings being stopped. In the case of ~C21~, only one message was recorded, the message whose send event was ~H~ and whose receive event was ~D~. So that event goes into ~C21~'s final channel state. In the case of ~C23~, it ends up being empty.
6. Finally, the marker message from ~P1~ to ~P2~ arrives last, and it leads to channel ~C12~ recording being stopped while empty.

The final snapshot consists of events: ~A~, ~B~, ~F~, ~G~, ~H~ and ~I~. Also, the channels recordings are ~C21= [H->D]~ while the rest are empty.

A question that might arise is: What’s the point of recording channel states? 
Imagine that we want at most one process in this execution to have exclusive access to some sort of resource (say, a file). We can think of access to the resource as being a token that processes pass around. At any given time, either a process should have the token, or it should be in transit between processes.

If we hadn't recorded on channels, the token status would have been lost from the snapshot perspective.


+ Chandy-Lamport guarantees :: 
  + Consistecy with causality.
  + Termination.
  + Decentralization: Works fine if more than one process initiates.




* Fault models

** Safety and liveness

+ Safety :: A property that states that some "bad" thing /won't/ ever happen. Properties discussed so far (FIFO delivery, causal delivery, totally-ordered delivery) are safety properties.


+ Liveness :: A property that states that a "good" property /will/ eventually happen. An example of this is eventual deliver (reliable deliver), or eventual consistency.

Safety properties /can/ be violeted in a /finite/ execution. Liveness properties /cannot/ be violeted in a /finite/ execution.

All properties are either safety or liveness or a combination.

** Faults models

When designing a system, certain assumptions about the environment in which that system will operate need to be made. In particular, when designing a fault tolerant system, it's important to know which faults can happen. A fault model determines what kind of faults can occur. A *fault model* is a specification that indicates what kinds of faults a system can exhibit.

Let's take a look at the following example where processes ~m1~ and ~m2~ communicate with each other via the network.

#+begin_src ascii
  ┌─────────┐  
  │  x?     ▼  
┌─┴┐       ┌──┐
│m1│       │m2│
└──┘       └┬─┘
  ▲   5     │  
  └─────────┘  
#+end_src


Things that can go wrong from ~m1~'s perspective, and not hear the expected answer back:

  1. Message from ~m1~ can get lost
  2. Message from ~m1~ is slow
  3. ~m2~ crashed
  4. ~m2~ is slow
  5. Message from ~m2~ is slow
  6. Message from ~m2~ can get lost
  7. ~m2~ lies

*Crash fault*: A process fails by halting, it stops sending/receiving messages. Case 3\\
*Fail-stop fault*: A process fails by halting, and everyone knows it crashed (this is not the case in a crash fault). For example, a process can bradcast its death so everyone knows. It's not very realistic.
*Omission fault*: A message is lost, a process fails to send or receive a message. Cases 1 and 6\\
*Timing fault*: A process responds too late (or too early). Cases 2, 4 and 5\\
*Byzantine fault*: A process behaves in arbitrary way or even malicious. Case 7


Fail-stop faults \(\,\subset\,\) Crash faults \(\, \subset\, \) Omission faults \( \,\subset\, \) Byzantine faults 

Regarding timing faults, in a distributed model, those are expected.

