courses/Distributed Systems/distributedSystems.html
<li><a id="orgeb62f87"></a>Chandy-Lamport algorithm (1985)<br />
<div class="outline-text-5" id="text-orgeb62f87">
<p>
We will call <i>channel</i> to a connection between two processes. Communication between two processes go through a channel. We introduce this notion to ensure FIFO ordering. This algorithm also assumes that messages aren't lost, corrupted or duplicated. Also assumes processes don't crash.
</p>

<p>
<i>Initiator</i>: 
</p>
<ol class="org-ol">
<li>Records its own state.</li>
<li>Sends a marker message out on all its outgoing channels.</li>
<li>Starts recording the messages it receives in all its incoming channels.</li>
</ol>

<p>
<i>When process p<sub>i</sub> receives a marker message on C<sub>ki</sub></i>:
</p>
<ul class="org-ul">
<li>If it's the first marker it has seen (sent or received)
<ol class="org-ol">
<li>p<sub>i</sub> records its state</li>
<li>p<sub>i</sub> will mark channel C<sub>ki</sub> as empty</li>
<li>p<sub>i</sub> sends a marker in all its outgoing channels</li>
<li>p<sub>i</sub> starts recording in all its incomming channels</li>
</ol></li>
<li>Otherwise
<ol class="org-ol">
<li>p<sub>i</sub> stops recording on C<sub>ki</sub></li>
</ol></li>
</ul>

<p>
Let's look at the following example<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, where process <code>P1</code> is the snapshot initiator.
</p>

<pre class="example">
C21= [H-&gt;D]   C12= &lt;&gt;   C13= &lt;&gt;
C31= &lt;&gt;       C32= &lt;&gt;   C23= &lt;&gt;

   __           __          __      
  |P1|         |P2|        |P3|    
   |            |            |            
 A +            |            |
   |            |       -----+ I            
 B +_______     |      /     |     
   |       \---&gt;+ F   /      |
   |===         |    /       |
   |  \\====================&gt;|
   |   \\       |  /         |
   |    \\    G +&lt;-          |    
   |     \\     |            |
 C +      \\    |        ====|
   |       \\   |      //    |
   |        ||  |     //     + J
   |&lt;===========|======      |
   |        ||  |     ||     |
   |     -------+ H   ||     |
   |    /   ||  |     ||     |
   |   /    ||  |&lt;=====      |
 D +&lt;-/     ||  |            |
   |     =======|===========&gt;|
   |   //   ||  |            |
   |&lt;===     \\ |            |
   |          =&gt;|            |
   |            |            |            
   v            v            v            
</pre>
<p>
[Example 10] 
</p>


<ol class="org-ol">
<li>First, <code>P1</code> records its own state, which consists of events <code>A</code> and <code>B</code>. Then it trigers two marking events (in the example marking events are represented with double lines). The marker message headed to <code>P2</code> is taking a while. The marker message sent to <code>P3</code> arrives quickly. Let's follow from there.</li>
<li>When <code>A</code>'s marker message arrives at <code>P3</code>, this process has never seen a marker message so far, so <code>P3</code> records its state, which consists of only the event <code>I</code> and marks channel <code>C13</code> as empty. Then it broadcasts marker messages and starts recording on all its incoming channels (<code>C23</code>).</li>
<li><code>P3</code> has sent out its marker messages. Let’s consider the one that went to <code>P1</code> first. This message is not the first marker message that <code>P1</code> has seen (it has seen its own marker messages), so it will stop recording on <code>C31</code>. As nothing happened on that channel, it ends up being empty.</li>
<li>Let's look at the marker message that <code>P3</code> sent to <code>P2</code>. As this is the first marker message that <code>P2</code> has seen, then it first records it state: <code>F</code>, <code>G</code> and <code>H</code>. Then it will mark channel <code>C32</code> as empty and start recording on all its incoming channels (only <code>C12</code>, as <code>C32</code> was already marked as empty). <code>P2</code> also sends its marker messages.</li>
<li><code>P2</code> marker messages will finally arrive to <code>P1</code> and <code>P3</code>, that will lead to channels <code>C21</code> and <code>C23</code> recordings being stopped. In the case of <code>C21</code>, only one message was recorded, the message whose send event was <code>H</code> and whose receive event was <code>D</code>. So that event goes into <code>C21</code>'s final channel state. In the case of <code>C23</code>, it ends up being empty.</li>
<li>Finally, the marker message from <code>P1</code> to <code>P2</code> arrives last, and it leads to channel <code>C12</code> recording being stopped while empty.</li>
</ol>

<p>
The final snapshot consists of events: <code>A</code>, <code>B</code>, <code>F</code>, <code>G</code>, <code>H</code> and <code>I</code>. Also, the channels recordings are <code>C21= [H-&gt;D]</code> while the rest are empty.
</p>

<p>
A question that might arise is: What’s the point of recording channel states? 
Imagine that we want at most one process in this execution to have exclusive access to some sort of resource (say, a file). We can think of access to the resource as being a token that processes pass around. At any given time, either a process should have the token, or it should be in transit between processes.
</p>

<p>
If we hadn't recorded on channels, the token status would have been lost from the snapshot perspective.
</p>


<dl class="org-dl">
<dt>Chandy-Lamport guarantees</dt><dd><ul class="org-ul">
<li>Consistecy with causality.</li>
<li>Termination.</li>
<li>Decentralization: Works fine if more than one process initiates.</li>
</ul></dd>
</dl>
</div>
</li>
</ul>
</div>




<div id="outline-container-org5a1911a" class="outline-2">
<h2 id="org5a1911a">Fault models</h2>
<div class="outline-text-2" id="text-org5a1911a">
</div>
<div id="outline-container-orgf83486a" class="outline-3">
<h3 id="orgf83486a">Safety and liveness</h3>
<div class="outline-text-3" id="text-orgf83486a">
<dl class="org-dl">
<dt>Safety</dt><dd>A property that states that some "bad" thing <i>won't</i> ever happen. Properties discussed so far (FIFO delivery, causal delivery, totally-ordered delivery) are safety properties.</dd>
</dl>


<dl class="org-dl">
<dt>Liveness</dt><dd>A property that states that a "good" property <i>will</i> eventually happen. An example of this is eventual deliver (reliable deliver), or eventual consistency.</dd>
</dl>

<p>
Safety properties <i>can</i> be violeted in a <i>finite</i> execution. Liveness properties <i>cannot</i> be violeted in a <i>finite</i> execution.
</p>

<p>
All properties are either safety or liveness or a combination.
</p>
</div>
</div>

<div id="outline-container-org36d4496" class="outline-3">
<h3 id="org36d4496">Faults models</h3>
<div class="outline-text-3" id="text-org36d4496">
<p>
When designing a system, certain assumptions about the environment in which that system will operate need to be made. In particular, when designing a fault tolerant system, it's important to know which faults can happen. A fault model determines what kind of faults can occur. A <b>fault model</b> is a specification that indicates what kinds of faults a system can exhibit.
</p>

<p>
Let's take a look at the following example where processes <code>m1</code> and <code>m2</code> communicate with each other via the network.
</p>

<div class="org-src-container">
<pre class="src src-ascii">  ┌─────────┐  
  │  x?     ▼  
┌─┴┐       ┌──┐
│m1│       │m2│
└──┘       └┬─┘
  ▲   5     │  
  └─────────┘  
</pre>
</div>


<p>
Things that can go wrong from <code>m1</code>'s perspective, and not hear the expected answer back:
</p>

<ol class="org-ol">
<li>Message from <code>m1</code> can get lost</li>
<li>Message from <code>m1</code> is slow</li>
<li><code>m2</code> crashed</li>
<li><code>m2</code> is slow</li>
<li>Message from <code>m2</code> is slow</li>
<li>Message from <code>m2</code> can get lost</li>
<li><code>m2</code> lies</li>
</ol>

<p>
<b>Crash fault</b>: A process fails by halting, it stops sending/receiving messages. Case 3<br />
<b>Fail-stop fault</b>: A process fails by halting, and everyone knows it crashed (this is not the case in a crash fault). For example, a process can bradcast its death so everyone knows. It's not very realistic.
<b>Omission fault</b>: A message is lost, a process fails to send or receive a message. Cases 1 and 6<br />
<b>Timing fault</b>: A process responds too late (or too early). Cases 2, 4 and 5<br />
<b>Byzantine fault</b>: A process behaves in arbitrary way or even malicious. Case 7
</p>


<p>
Fail-stop faults \(\,\subset\,\) Crash faults \(\, \subset\, \) Omission faults \( \,\subset\, \) Byzantine faults 
</p>

<p>
Regarding timing faults, in a distributed model, those are expected.
</p>
</div>
</div>
