courses/Distributed Systems/distributedSystems.org
** Two generals problem

Two armies, each led by a different general, are preparing to attack a fortified city. The armies are encamped near the city, each in its own valley. A third valley separates the two hills, and the only way for the two generals to communicate is by sending messengers through the valley. Unfortunately, the valley is occupied by the city's defenders and there's a chance that any given messenger sent through the valley will be captured.

#+BEGIN_SRC
             __          __ 
            |G1|        |G2|
Let's attack |           |
  at dawn    |\--------->|
             |           |
             |          /| Ok 
             |<--------- |
             |           | 
             v           v
#+END_SRC

General 1 sends a message proposing a combined attack at dawn. General 2 receives the message and responds positively. Can G1 confidently attack at dawn? No, as she knows that is impossible for G2 to know that her "Ok" message has arrived. Let's say G1 acknowledges G2's message. Can she be sure now? No. In this setting, it is impossible for G1 and G2 to attack being sure that the otther will.

The setting here is the *omission model*, where omission faults are expected.

A possible workaround is to base the attack on probability. G1 will send several messages to propose attacks and will stop sending them on G2's acknowledgement. If it's been a while since G2 has stopped listening to G1's messages, then it can be confident that she received the message. Confidence grows as time passes and no new messagges arrives.


#+BEGIN_SRC
             __          __ 
            |G1|        |G2|
Let's attack |           |
  at dawn    |\----->    |
Let's attack |           |
  at dawn    |\----->    |
Let's attack |           |
  at dawn    |\----->    |
Let's attack |           |
  at dawn    |\--------->|
Let's attack |           |
  at dawn    |\---->     |
             |          /| Ok 
             |<--------- | .
             |           | .
             |           | .
             |           | .
             v           v
#+END_SRC

A second workaround is based on common knowledge. Knowledge is considered *common* if everyone knows about it and everyone knows that everyone knows.


** Forms of fault tolerance

We've discussed byzantine faults, it turns out there are some of those faults that are easier to avoid.
Say that you can detect messages being corrupted (via checksum for example). In that case you can treat it as an ommision fault and just discard the message.

What does it mean to tolerate a class of faults? 
A correct program satisfies both its safety and liveness properties. 

How wrong does a program go in the presence of a given class of faults

|          | live        | not live  |
| safe     | masking     | fail safe |
| not safe | non masking |           |

For example, in FIFO delivery, let's say that its safety property talks about the order of the messages in the delivery, while liveness talks about messages eventually arriving. Then it might be useful to have a fails-safe model that preserves order while maybe compromising some messages arriving.

**** Reliable delivery 

Let ~p1~ be a process that delivers a message ~m~ to process ~p2~. Then if neither ~p1~ not ~p2~ crashes and not all messages are lost, then ~p2~ eventually delivers ~m~.


A possible implementation of reliable delivery is the one described in the two generals section. The sender might send the message on and on until it receives an ack. The problem with this implementation is that the receiver ack might be lost, so the receiver will still be getting messages. This might or might not be an issue. In the case of the two generals it was not an issue. In general, if the message is idempotent, there's not an issue.

Reliable delivery is also called /at-least-once/ delivery.

Can we have /exactly-once/ delivery?

Systems that claim to have exactly-once delivery mainly fit into one of these two categories: 1. The messsages where idempotent anyway or 2. They make an effort on receiver's side to deduplicate messages.

**** Reliable broadcast

It stands for /one sends, everyone receives/.

If a correct process delivers ~m~, then all correct processes deliver ~m~. The definition of /correct process/ will depend on the fault model we're based on. If the fault model is the crash model, then messages being lost is not an issue, and processes are correct if they don't crash. In the ommision model, we will have to add the condition of not all messages being lost.

For now, we're on the crash model.

#+BEGIN_SRC
   _            _            _      
  |A|          |B|          |C|    
   |            |            |           
   +_______     |            |     
   |       \--->+ ✓          |
   X            |            |
   X            |            |            
   v            v            v            
#+END_SRC

[Example 11] 

In this example, process ~A~ sends the first message of the braodcast to ~B~ and ~B~ delivers, but then ~A~ crashes before it can send it to ~C~.

As you can see, this protocol does not reliably deliver.

Let's say now that everytime a process receives a message, it broadcasts it to everyone else before delivering it.

#+BEGIN_SRC
   _            _            _      
  |A|          |B|          |C|    
   |            |            |           
   +_______     |            |     
   |       \--->+            |
   X          --+            |
   X<--------/  +--          |            
   X            |  \-------->+
   X            | ✓        --+
   X            |         / /+
   X            |<-------/ / | ✓
   X            |         /  |
   X<--------------------/   |
   X            |            |
   v            v            v            
#+END_SRC

[Example 12] 

Even thought ~A~ crashes, ~B~ will be also broadcasting the message to ~C~ (and ~A~) and then delivering it. When ~C~ receives the message it will do the same. 

So if ~B~ also crashes after the first message, then no one would have delivered, and the reliability condition would be met. If ~B~ crashes after sending the two messages, then ~C~ would be delivering but it would also be the only correct process and the condition would also be met.

A good addition would be to not send the message back to the sender.

If no one crashes, processes will see the message more than once. They will need to keep track of what they've delivered so they don't do it twice

If we need this protocol to also work on the omission model, we can just make each message follow the reliable deliver protocol as well, and build the broadcasting on top of it.

| Fault-tolerance often involves making copies.


* Replication

Why replicate data?

+ Fault-tolerance: prevent data loss.
+ Scale horizontally: divides the load.
+ Data locality

Downsides:
+ Higher cost
+ Keep consistent replicas


- Strong consistency :: A replicated storage system is strongly consistent if clients cannot tell that the data is replicated.

