courses/Distributed Systems/distributedSystems.html

<div id="outline-container-org234df1e" class="outline-3">
<h3 id="org234df1e">Two generals problem</h3>
<div class="outline-text-3" id="text-org234df1e">
<p>
Two armies, each led by a different general, are preparing to attack a fortified city. The armies are encamped near the city, each in its own valley. A third valley separates the two hills, and the only way for the two generals to communicate is by sending messengers through the valley. Unfortunately, the valley is occupied by the city's defenders and there's a chance that any given messenger sent through the valley will be captured.
</p>

<pre class="example">
	     __          __ 
	    |G1|        |G2|
Let's attack |           |
  at dawn    |\---------&gt;|
	     |           |
	     |          /| Ok 
	     |&lt;--------- |
	     |           | 
	     v           v
</pre>

<p>
General 1 sends a message proposing a combined attack at dawn. General 2 receives the message and responds positively. Can G1 confidently attack at dawn? No, as she knows that is impossible for G2 to know that her "Ok" message has arrived. Let's say G1 acknowledges G2's message. Can she be sure now? No. In this setting, it is impossible for G1 and G2 to attack being sure that the otther will.
</p>

<p>
The setting here is the <b>omission model</b>, where omission faults are expected.
</p>

<p>
A possible workaround is to base the attack on probability. G1 will send several messages to propose attacks and will stop sending them on G2's acknowledgement. If it's been a while since G2 has stopped listening to G1's messages, then it can be confident that she received the message. Confidence grows as time passes and no new messagges arrives.
</p>


<pre class="example">
	     __          __ 
	    |G1|        |G2|
Let's attack |           |
  at dawn    |\-----&gt;    |
Let's attack |           |
  at dawn    |\-----&gt;    |
Let's attack |           |
  at dawn    |\-----&gt;    |
Let's attack |           |
  at dawn    |\---------&gt;|
Let's attack |           |
  at dawn    |\----&gt;     |
	     |          /| Ok 
	     |&lt;--------- | .
	     |           | .
	     |           | .
	     |           | .
	     v           v
</pre>

<p>
A second workaround is based on common knowledge. Knowledge is considered <b>common</b> if everyone knows about it and everyone knows that everyone knows.
</p>
</div>
</div>


<div id="outline-container-org900cada" class="outline-3">
<h3 id="org900cada">Forms of fault tolerance</h3>
<div class="outline-text-3" id="text-org900cada">
<p>
We've discussed byzantine faults, it turns out there are some of those faults that are easier to avoid.
Say that you can detect messages being corrupted (via checksum for example). In that case you can treat it as an ommision fault and just discard the message.
</p>

<p>
What does it mean to tolerate a class of faults? 
A correct program satisfies both its safety and liveness properties. 
</p>

<p>
How wrong does a program go in the presence of a given class of faults
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">live</td>
<td class="org-left">not live</td>
</tr>

<tr>
<td class="org-left">safe</td>
<td class="org-left">masking</td>
<td class="org-left">fail safe</td>
</tr>

<tr>
<td class="org-left">not safe</td>
<td class="org-left">non masking</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
For example, in FIFO delivery, let's say that its safety property talks about the order of the messages in the delivery, while liveness talks about messages eventually arriving. Then it might be useful to have a fails-safe model that preserves order while maybe compromising some messages arriving.
</p>
</div>

<ul class="org-ul">
<li><a id="orgdf55b28"></a>Reliable delivery<br />
<div class="outline-text-5" id="text-orgdf55b28">
<p>
Let <code>p1</code> be a process that delivers a message <code>m</code> to process <code>p2</code>. Then if neither <code>p1</code> not <code>p2</code> crashes and not all messages are lost, then <code>p2</code> eventually delivers <code>m</code>.
</p>


<p>
A possible implementation of reliable delivery is the one described in the two generals section. The sender might send the message on and on until it receives an ack. The problem with this implementation is that the receiver ack might be lost, so the receiver will still be getting messages. This might or might not be an issue. In the case of the two generals it was not an issue. In general, if the message is idempotent, there's not an issue.
</p>

<p>
Reliable delivery is also called <i>at-least-once</i> delivery.
</p>

<p>
Can we have <i>exactly-once</i> delivery?
</p>

<p>
Systems that claim to have exactly-once delivery mainly fit into one of these two categories: 1. The messsages where idempotent anyway or 2. They make an effort on receiver's side to deduplicate messages.
</p>
</div>
</li>

<li><a id="org1d03273"></a>Reliable broadcast<br />
<div class="outline-text-5" id="text-org1d03273">
<p>
It stands for <i>one sends, everyone receives</i>.
</p>

<p>
If a correct process delivers <code>m</code>, then all correct processes deliver <code>m</code>. The definition of <i>correct process</i> will depend on the fault model we're based on. If the fault model is the crash model, then messages being lost is not an issue, and processes are correct if they don't crash. In the ommision model, we will have to add the condition of not all messages being lost.
</p>

<p>
For now, we're on the crash model.
</p>

<pre class="example">
 _            _            _      
|A|          |B|          |C|    
 |            |            |           
 +_______     |            |     
 |       \---&gt;+ ✓          |
 X            |            |
 X            |            |            
 v            v            v            
</pre>

<p>
[Example 11] 
</p>

<p>
In this example, process <code>A</code> sends the first message of the braodcast to <code>B</code> and <code>B</code> delivers, but then <code>A</code> crashes before it can send it to <code>C</code>.
</p>

<p>
As you can see, this protocol does not reliably deliver.
</p>

<p>
Let's say now that everytime a process receives a message, it broadcasts it to everyone else before delivering it.
</p>

<pre class="example">
 _            _            _      
|A|          |B|          |C|    
 |            |            |           
 +_______     |            |     
 |       \---&gt;+            |
 X          --+            |
 X&lt;--------/  +--          |            
 X            |  \--------&gt;+
 X            | ✓        --+
 X            |         / /+
 X            |&lt;-------/ / | ✓
 X            |         /  |
 X&lt;--------------------/   |
 X            |            |
 v            v            v            
</pre>

<p>
[Example 12] 
</p>

<p>
Even thought <code>A</code> crashes, <code>B</code> will be also broadcasting the message to <code>C</code> (and <code>A</code>) and then delivering it. When <code>C</code> receives the message it will do the same. 
</p>

<p>
So if <code>B</code> also crashes after the first message, then no one would have delivered, and the reliability condition would be met. If <code>B</code> crashes after sending the two messages, then <code>C</code> would be delivering but it would also be the only correct process and the condition would also be met.
</p>

<p>
A good addition would be to not send the message back to the sender.
</p>

<p>
If no one crashes, processes will see the message more than once. They will need to keep track of what they've delivered so they don't do it twice
</p>

<p>
If we need this protocol to also work on the omission model, we can just make each message follow the reliable deliver protocol as well, and build the broadcasting on top of it.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Fault-tolerance often involves making copies.</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3a8617b" class="outline-2">
<h2 id="org3a8617b">Replication</h2>
<div class="outline-text-2" id="text-org3a8617b">
<p>
Why replicate data?
</p>

<ul class="org-ul">
<li>Fault-tolerance: prevent data loss.</li>
<li>Scale horizontally: divides the load.</li>
<li>Data locality</li>
</ul>

<p>
Downsides:
</p>
<ul class="org-ul">
<li>Higher cost</li>
<li>Keep consistent replicas</li>
</ul>


<dl class="org-dl">
<dt>Strong consistency</dt><dd>A replicated storage system is strongly consistent if clients cannot tell that the data is replicated.</dd>
</dl>
</div>
