courses/Distributed Systems/distributedSystems.org
*** Primary-backup replication 
A particular process is chosen as the primary, and the rest are backup. Clients only operates with the primary

*** Chain replication 
The primary receives writes, sends the write event to next replica and this goes on until the last replica, that both applies the change and responds to client. Reads are from last replica. This one has better write throughput, and better at scaling horizontally, as it divides the load between reads and writes. Works best at 15% writes, 85% reads, as it divides the work more or less equally. Write latency is higher (depending on number of replicas), as replication requests are sequential.


*** Total order vs. determinism


#+BEGIN_SRC
   _            _          _            _
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _x=2__|
   |  \    \--->|          |<----/    / |
   |   \        |    x=1   |         /  |
   |    \----------------->|        /   |
   |            |          |   x=2 /    |
   |            |<----------------/     |
   |            |          |            |
   v            v          v            v
#+END_SRC

In the first replica, ~x~ will end up being 2, while in the second replica it will end up being 1. This is a violation of total order delivery.

If we had only one replica, ~x~ could end up being 1 or 2, but it does not violate total order delivery. So in this case the behaviour is not deterministic, as multiple runs of the same scenario could end up in different result.

** Consistency models

- Read your writes (RYW) :: Reading a value after wrinting it gives you the value just written. 

Example 13 shows a scenario where read your writes does not hold

#+BEGIN_SRC
  __            __           __
  |A|          |R1|         |R2|
   |            |            | 
   |\__x=4_     |            |
   |       \--->|            |
   |            |            |
   |  ack   ----|            |
   |<------/    |            |
   |            |            |
   |\___x?_     |            |
   |       \---------------->|
   |            |            |
   |  ???   -----------------|
   |<------/    |            |
   v            v            v
#+END_SRC
[Example 13]

- FIFO consistency :: Writes done by a process are seen by all processes.

The folowing example violates FIFO consistency.

#+BEGIN_SRC
   _            __           __           _
  |A|          |R1|         |R2|         |B|
   |            |            |            |  
   |\_dep50$    |            |            | 
   |       \--->|-           |            | 
   |            | \          |            | 
   |   ok   ----|  \dep50$   |            | 
   |<------/    |   \        |            | 
   |            |    \       |            | 
   |\_wd40$     |     \      |            | 
   |       \--->|- wd40\     |            | 
   |            | \--------->|  /---------| balance? 
   |  ok    ----|        \   |<-          |
   |<------/    |         \  |----------->| -40$
   |            |          ->|            | 
   v            v            v            v
#+END_SRC
[Example 14]

- Causal consistency :: Writes that are related by happens-before relationship must be seen in the same causal order by all processes.

The following example is a violation of causal consistency.

#+BEGIN_SRC
   _            __           __           _
  |A|          |R1|         |R2|         |B|
   |            |            |            |  
   |\dep100$    |            |           /| balance?
   |       \--->|            |          / | 
   |            |            |         /  | 
   |   ok   ----|            |        /   | 
   |<------/    |<-------------------/    | 
   |            |----------------         | 
   |            |            |   \------->| 100$ 
   |            |            |            | 
   |            |            |  /---------| wd50$ 
   |            |            |<-          |
   |            |            |----------->| No funds
   |            |            |            | 
   v            v            v            v
#+END_SRC
[Example 15]

#+begin_verse
Strong consistency \(\,\subset\,\) Causal consistency \(\, \subset\, \) FIFO consistency \( \,\subset\, \) RYW consistency 
#+end_verse

These are only some consistency models that can be find.


*** Strongly consistent replication models

There are two alreay discussed: primary back up and chain replication.
In these two models, there also has to exist some sort of coordinator that knows about replicas, the order(in the case of chain replication) and its status, whether it has failed or not. In case of failure, the coordinator will acknowledge that and rearrange the chain in the case of chain replication or the fact about who's the primary in primary back up.

But what if the coordinator fails? As we would like to keep coordination separated from the data nodes themselves, having no coordinator at all might not be the best solution. We could have many coordinators running a consensus protocol. 


* Consensus

When do we need consensus? When we have a bunch of processes and ...
- we need them to deliver messages in the same order (*totally-ordered broadcast*), or
- we need all of them to know about the rest (*group membership*), or
- one of them has a special role and the rest need to know about that (*leader election*), or
- there's a shared resource that can only be accesses by one at a time (*distributed mutual exclusion*), or
- they are participating in a transaction where a desicion about commiting/abouting needs to be agreed upon (*distributed transaction commit*)


#+BEGIN_SRC
         ┌───────────┐         
1 ──────►│           ├──────► 1
         │           │         
0 ──────►│ Consensus ├──────► 1
         │           │         
1 ──────►│           ├──────► 1
         └───────────┘         
#+END_SRC

Properties to /try/ to satisfy:

- Termination :: Each correct process eventually decides on a value.
- Agreement :: All correct processes decide on the same value.
- Validity (integrity, non-triviality) :: The agreed upon value must be one of the proposed values.

In the asynchronous network model and the crash fault model, no consensus algorithms can satisfy all these three. This was proved in 1983 by Fisher Lynch and Patterson (FLP)[fn:FLP], this is called the impossibility of distributed consensus with one faulty process.



