courses/Distributed Systems/distributedSystems.html

<div id="outline-container-org384a834" class="outline-4">
<h4 id="org384a834">Primary-backup replication</h4>
<div class="outline-text-4" id="text-org384a834">
<p>
A particular process is chosen as the primary, and the rest are backup. Clients only operates with the primary
</p>
</div>
</div>

<div id="outline-container-orgc2be52c" class="outline-4">
<h4 id="orgc2be52c">Chain replication</h4>
<div class="outline-text-4" id="text-orgc2be52c">
<p>
The primary receives writes, sends the write event to next replica and this goes on until the last replica, that both applies the change and responds to client. Reads are from last replica. This one has better write throughput, and better at scaling horizontally, as it divides the load between reads and writes. Works best at 15% writes, 85% reads, as it divides the work more or less equally. Write latency is higher (depending on number of replicas), as replication requests are sequential.
</p>
</div>
</div>


<div id="outline-container-org0fbac83" class="outline-4">
<h4 id="org0fbac83">Total order vs. determinism</h4>
<div class="outline-text-4" id="text-org0fbac83">
<pre class="example">
 _            _          _            _
|C1|         |R1|       |R2|         |C2|
 |            |          |            |
 |____x=1     |          |      _x=2__|
 |  \    \---&gt;|          |&lt;----/    / |
 |   \        |    x=1   |         /  |
 |    \-----------------&gt;|        /   |
 |            |          |   x=2 /    |
 |            |&lt;----------------/     |
 |            |          |            |
 v            v          v            v
</pre>

<p>
In the first replica, <code>x</code> will end up being 2, while in the second replica it will end up being 1. This is a violation of total order delivery.
</p>

<p>
If we had only one replica, <code>x</code> could end up being 1 or 2, but it does not violate total order delivery. So in this case the behaviour is not deterministic, as multiple runs of the same scenario could end up in different result.
</p>
</div>
</div>

<div id="outline-container-org8ff9e84" class="outline-3">
<h3 id="org8ff9e84">Consistency models</h3>
<div class="outline-text-3" id="text-org8ff9e84">
<dl class="org-dl">
<dt>Read your writes (RYW)</dt><dd>Reading a value after wrinting it gives you the value just written.</dd>
</dl>

<p>
Example 13 shows a scenario where read your writes does not hold
</p>

<pre class="example">
__            __           __
|A|          |R1|         |R2|
 |            |            | 
 |\__x=4_     |            |
 |       \---&gt;|            |
 |            |            |
 |  ack   ----|            |
 |&lt;------/    |            |
 |            |            |
 |\___x?_     |            |
 |       \----------------&gt;|
 |            |            |
 |  ???   -----------------|
 |&lt;------/    |            |
 v            v            v
</pre>
<p>
[Example 13]
</p>

<dl class="org-dl">
<dt>FIFO consistency</dt><dd>Writes done by a process are seen by all processes.</dd>
</dl>

<p>
The folowing example violates FIFO consistency.
</p>

<pre class="example">
 _            __           __           _
|A|          |R1|         |R2|         |B|
 |            |            |            |  
 |\_dep50$    |            |            | 
 |       \---&gt;|-           |            | 
 |            | \          |            | 
 |   ok   ----|  \dep50$   |            | 
 |&lt;------/    |   \        |            | 
 |            |    \       |            | 
 |\_wd40$     |     \      |            | 
 |       \---&gt;|- wd40\     |            | 
 |            | \---------&gt;|  /---------| balance? 
 |  ok    ----|        \   |&lt;-          |
 |&lt;------/    |         \  |-----------&gt;| -40$
 |            |          -&gt;|            | 
 v            v            v            v
</pre>
<p>
[Example 14]
</p>

<dl class="org-dl">
<dt>Causal consistency</dt><dd>Writes that are related by happens-before relationship must be seen in the same causal order by all processes.</dd>
</dl>

<p>
The following example is a violation of causal consistency.
</p>

<pre class="example">
 _            __           __           _
|A|          |R1|         |R2|         |B|
 |            |            |            |  
 |\dep100$    |            |           /| balance?
 |       \---&gt;|            |          / | 
 |            |            |         /  | 
 |   ok   ----|            |        /   | 
 |&lt;------/    |&lt;-------------------/    | 
 |            |----------------         | 
 |            |            |   \-------&gt;| 100$ 
 |            |            |            | 
 |            |            |  /---------| wd50$ 
 |            |            |&lt;-          |
 |            |            |-----------&gt;| No funds
 |            |            |            | 
 v            v            v            v
</pre>
<p>
[Example 15]
</p>

<p class="verse">
Strong consistency \(\,\subset\,\) Causal consistency \(\, \subset\, \) FIFO consistency \( \,\subset\, \) RYW consistency<br />
</p>

<p>
These are only some consistency models that can be find.
</p>
</div>


<div id="outline-container-org564f936" class="outline-4">
<h4 id="org564f936">Strongly consistent replication models</h4>
<div class="outline-text-4" id="text-org564f936">
<p>
There are two alreay discussed: primary back up and chain replication.
In these two models, there also has to exist some sort of coordinator that knows about replicas, the order(in the case of chain replication) and its status, whether it has failed or not. In case of failure, the coordinator will acknowledge that and rearrange the chain in the case of chain replication or the fact about who's the primary in primary back up.
</p>

<p>
But what if the coordinator fails? As we would like to keep coordination separated from the data nodes themselves, having no coordinator at all might not be the best solution. We could have many coordinators running a consensus protocol. 
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org01906d8" class="outline-2">
<h2 id="org01906d8">Consensus</h2>
<div class="outline-text-2" id="text-org01906d8">
<p>
When do we need consensus? When we have a bunch of processes and &#x2026;
</p>
<ul class="org-ul">
<li>we need them to deliver messages in the same order (<b>totally-ordered broadcast</b>), or</li>
<li>we need all of them to know about the rest (<b>group membership</b>), or</li>
<li>one of them has a special role and the rest need to know about that (<b>leader election</b>), or</li>
<li>there's a shared resource that can only be accesses by one at a time (<b>distributed mutual exclusion</b>), or</li>
<li>they are participating in a transaction where a desicion about commiting/abouting needs to be agreed upon (<b>distributed transaction commit</b>)</li>
</ul>


<pre class="example">
	 ┌───────────┐         
1 ──────►│           ├──────► 1
	 │           │         
0 ──────►│ Consensus ├──────► 1
	 │           │         
1 ──────►│           ├──────► 1
	 └───────────┘         
</pre>

<p>
Properties to <i>try</i> to satisfy:
</p>

<dl class="org-dl">
<dt>Termination</dt><dd>Each correct process eventually decides on a value.</dd>
<dt>Agreement</dt><dd>All correct processes decide on the same value.</dd>
<dt>Validity (integrity, non-triviality)</dt><dd>The agreed upon value must be one of the proposed values.</dd>
</dl>

<p>
In the asynchronous network model and the crash fault model, no consensus algorithms can satisfy all these three. This was proved in 1983 by Fisher Lynch and Patterson (FLP)<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>, this is called the impossibility of distributed consensus with one faulty process.
</p>
</div>
