courses/Distributed Systems/distributedSystems.org
** Paxos

Paxos[fn:paxos][fn:paxos-simple] is a consensus algorithm proposed by Leslie Lamport. 

In this algorithm, there's three roles that a process can play (one or more): 

- *Proposer* proposes values
- *Acceptor* contributes to choose from the proposed values
- *Learner* learns the agreed upon values

Paxos nodes must:
- persist data
- know which number conforms a majority of acceptors

The algorithm rules are:

*Phase 1* Kick off

- A *proposer* sends a prepare message, with a proposal id ~n~ to (at least) a majority of accepters. ~n~ must be unique and higher than any proposed number that this proposer has proposed before. Uniqueness must also work across proposers, so they will have to previously decide on a set of values each can use (if there's two proposers, one can take odd numbers and the other one even).

- When an *acceptor* receives a ~prepera(n)~ message, 
  - IF this node promised to ignore any proposal with this ~n~ id, it ignores the message.
  - IF NOT, it promises to ignore any request with a proposal number lower than ~n~, and replies with ~promise(n)~.  (*)

*Phase 2* Proposer has received ~promise(n)~ from a majority of acceptors (for some id ~n~).

- *Proposer* sends an ~accept(n, val)~ to (at least) a majority of acceptors, where ~n~ is the id promised in phase 1, and ~val~ is the actual value it wants to propose. (**)
- *Acceptor* on receiving an ~accept(n, val)~ will
  - IF this node promised to ignore any proposal with this ~n~, it ignores the message
  - IF NOT, replies with ~accepted(n,val)~ and also sends that message to all the learners

Let's look at a simple example:



#+BEGIN_SRC
             _            __           __           __           __            __
            |P|          |A1|         |A2|         |A3|         |L1|          |L2|            
             |            |             |            |            |             |   
  prepare(5) |\---------->|             |            |            |             |
             | \----------------------->|            |            |             | 
             |            |             |            |            |             | 
             |        ----|prom(5)      |            |            |             |
             |<------/  ----------------| prom(5)    |            |             | 
             |<------- /  |             |            |            |             |
             |            |             |            |            |             | 
             |            |             |            |            |             | 
milestone 1 ---------------------------------------------------------------------------
             |            |             |            |            |             |   
accept(5,X)  |\---------->|             |            |            |             |
             | \----------------------->|            |            |             | 
             |        ----|accptd(5,X)  |            |            |             |
             |<------/    |\            |            |            |             |
             |            |\--------------------------------------------------->|
             |            | ------------------------------------->|             |
             |            |             |            |            |             |   
             |          ----------------|accptd(5,X) |            |             |   
             |<--------/  |             |            |            |             |   
             |            |             |\------------------------------------->|
             |            |             |\----------------------->|             |
             |            |             |            |            |             | 
             |            |             |            |            |             | 
milestone 2 ---------------------------------------------------------------------------
             |            |             |            |            |             | 
             |            |             |            |            |             | 
             |            |             |            |            |             | 
             v            v             v            v            v             v
#+END_SRC
[Example 16]

First, the proposer ~P~ sends ~prepare(5)~ to a majority of accepters, in this case to ~A1~ and ~A2~. Both of them have never promised to reject ~5~, so they respond with ~promised(5)~.

At milestone 1, the proposed id ~n~ has been accepted by a majority of accepters.

Now ~P~ can propose a value to agree upon, in this case that value will be ~X~. For this, it sends ~accept(5, X)~ to a majority of acceptors. As ~A1~ and ~A2~ have never promised to reject ~5~, they respond with ~accepted(5,X)~, and they also send this message to learners.

At milestone 2, consensus is reached, as a majority af acceptors have accepted a value ~X~. ~A1~ and ~A2~ still don't know about this, but the proposer does.

Milestone 3 happens independently, when each node knows the consensus has been reached about the value ~X~.


So far we've seen the simple paxos. We've placed some asterisks in the algorithm description to elaborate more.

(*) In the case of phase 1, when an acceptor receives a message ~promise(n)~, and it has NOT promised to ignore than ~n~, then
  - IF it has previously accepted on something, it replies with ~promise(n, (n_prev, val_prev))~
  - IF NOT, it replies with ~promise(n)~

(**) In phase 2, when a proposer has received ~promise(n)~ or ~promise(n, (n_prev, val_prev))~ from a majority of acceptors (for some id ~n~), then it sends an ~accept(n, val)~ to (at least) a majority of acceptors, where ~n~ is the id promised in phase 1 and ~val~ is the  ~val_prev~ that came with the highest id ~n_prev~. If there where none of those messages, then it can propose its own value.

The example 16 does not explore these new paths, so let's look at another slighly more complex example, with two proposers. Learners are not drawn, for simplicity.


#+BEGIN_SRC
             _            __           __            __            __
            |P1|         |A1|         |A2|          |A3|          |P2|            
             |            |             |             |            |
  prepare(5) |\---------->|             |             |            |
             | \----------------------->|             |            |
             |            |             |             |            |
             |        ----|promise(5)   |             |            |
             |<------/  ----------------| prom(5)     |            |
             |<------- /  |             |             |            |
             |            |             |             |            |
             |            |             |             |            |
             |            |             |             |            |
accept(5,X)  |\---------->|             |             |            |
             | \----------------------->|             |<----------/| prepare(6)
             |        ----|acceptd(5,X) |             |\         / |
             |<------/    |<----------------------------\-------/  |
             |            |             |             |  \-------->| promise(6)
             |            |             |             |       /    |             
             |          ----------------|acceptd(5,X) |      /     |             
             |<--------/  |             |             |     /      |             
             |            |             |<-----------------/       |   
             |            |             |             |            |
             |            |\-------------------------------------->| promise(6,(5,X))
             |            |             |\------------------------>| promise(6,(5,X))
             |            |             |             |            |      
             |            |             |             |            |         
             |            |             |             |<----------/| accept(6, X)
             |            |             |<-----------------------/ |
             |            |             |             |\---------->| accepted(6,X)
             |            |             |\------------------------>| accepted(6,X)
             v            v             v            v            v      
#+END_SRC
[Example 17]

In this example, after ~A1~ and ~A2~ have responded with ~accepted(5,X)~ and ~P1~ has reached milestone 1, proposer ~P2~ starts a new consensus run by sending ~prepare(6)~ messages to the three accepters. ~A3~ hadn't promissed or accepted anuthing before so it responds with ~promise(6)~.

In the case of ~A1~ and ~A2~, they had both already accepted the value ~X~ for run ~5~, so they respond with ~promise(6,(5,X)))~. When ~P2~ receives these messages, it takes the value of the higher previously promised ~n~. In this case they are both 5, so the value chosen will be ~X~.

At this point ~P2~ starts phase 2 by sending ~accept(6, X)~ to a majority of accepters (~A1~, ~A2~ and ~A3~) which respond with ~accepted~ messages.


*Facts about paxos*
- If a majority of acceptors promise on a number ~n~, no paxos run with value less than ~n~ can succeed.
- If a majority of acceptors accept on ~(n, value)~ then consensus is reached. Consensus is about ~value~ an not id ~n~.
- If a proposer or a learner gets majority of accepts on a value for a specific ~n~, then they know that consensus has been reached on that value.

*Dueling proposers*

What about the FLP result? Well, the property that paxos fails to guarantee is termination. In example 18 you can see how two proposers can step into each others toes.


#+BEGIN_SRC
             _            __             __            __            __
            |P1|         |A1|           |A2|          |A3|          |P2|            
             |            |               |             |            |
  prepare(5) |\---------->|               |             |            |
             | \------------------------->|             |            |
             |            |               |             |            |
             |        ----|               |             |            |
  promise(5) |<------/  ------------------|             |            |
  promise(5) |<------- /  |               |             |            |
             |            |               |             |            |
             |            |               |             |<----------/| prepare(6)
             |            |               |             |\         / |
             |            |               |<--------------\-------/  |
             |            |               |             |  \-------->| promise(6)
             |            |               |             |            |     
             |            |               |\------------------------>| promise(6)
  accept(5,A)|\---------->|               |             |            |
             | \------------------------->X             |            |
      .      |            |               |             |            |
      .      |        ----|accepted(5,A)  |             |            |
      .      |<------/    |               |             |            |
   TIMEOUT   |            |               |             |            |
  prepare(7) |\---------->|               |             |<----------/| accept(6,B)
             | \------------------------->|             |\         / |
             |        ----|               |             | \       /  |
  promise(7) |<------/  ------------------|             |  \-----/-->| accepted(6,B)
  promise(7) |<------- /  |               |             |       /    |     .
             |            |               X<-------------------/     |     . 
             |            |               |             |            |     .
             |            |               |             |            |  TIMEOUT
             |            |               |             |<----------/| prepare(8)
             |            |               |             |\         / |
             |            |               |<--------------\-------/  |
             |            |               |             |  \-------->| promise(8)
             |            |               |             |            |     
             |            |               |\------------------------>| promise(8)
  accept(7,A)|\---------->|               |             |            |
             | \------------------------->X             |            |
             |            |               |             |            |
             v            v               v             v            v      
#+END_SRC
[Example 18]

In the example, ~P1~ starts a consensus run, gets promises on ~5~ from ~A1~ and ~A2~.\\
Right after that, and before ~P1~ can propose value ~A~, ~P2~ starts a consensus run and gets promises on ~6~ from ~A2~ and ~A3~. This can happen because ~A2~ still did not accept anything.\\
When ~P1~ sends the accept messages, ~A1~ will respond accepting, but message will be ignored by ~A2~, because ~A2~ has just promised on ignoring ids less than ~6~.\\
Time passes and ~P1~ timeouts on waiting for accepted mesage from ~A2~, so it starts a new round. It sends prepare message with an increased id of ~7~, and gets the promises back from ~A1~ and ~A2~, as before. \\
Right after ~A2~ promises on rejecting ids less than ~7~, the accept message from proposer ~P2~ arrived, and therefore ignored. So ~P2~ will also timeout waiting for ~A2~'s response.\\
This can go on and on forever.

So how can we deal with this issue?

We can try to mitigate the problem using some heuristics.

One possibility is to /try/ to have only one proposer, so dueling never happens. For that, we can elect a leader, using another consensus algorithm. Why another? to use one that guarantees termination. Maybe that other algorithm does not guarantee uniqueness of the leader, but even in that case it reduces the chances of dueling happening, as long as it decides on only one leader most of the time.

Another alternative is imposing an exponential backoff pause after timeout, so that eventually one proposer can get its value accepted before the other process proposes a new id.


