courses/Distributed Systems/distributedSystems.html



<div id="outline-container-org6b20f1c" class="outline-3">
<h3 id="org6b20f1c">Paxos</h3>
<div class="outline-text-3" id="text-org6b20f1c">
<p>
Paxos<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup><sup>, </sup><sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> is a consensus algorithm proposed by Leslie Lamport. 
</p>

<p>
In this algorithm, there's three roles that a process can play (one or more): 
</p>

<ul class="org-ul">
<li><b>Proposer</b> proposes values</li>
<li><b>Acceptor</b> contributes to choose from the proposed values</li>
<li><b>Learner</b> learns the agreed upon values</li>
</ul>

<p>
Paxos nodes must:
</p>
<ul class="org-ul">
<li>persist data</li>
<li>know which number conforms a majority of acceptors</li>
</ul>

<p>
The algorithm rules are:
</p>

<p>
<b>Phase 1</b> Kick off
</p>

<ul class="org-ul">
<li>A <b>proposer</b> sends a prepare message, with a proposal id <code>n</code> to (at least) a majority of accepters. <code>n</code> must be unique and higher than any proposed number that this proposer has proposed before. Uniqueness must also work across proposers, so they will have to previously decide on a set of values each can use (if there's two proposers, one can take odd numbers and the other one even).</li>

<li>When an <b>acceptor</b> receives a <code>prepera(n)</code> message, 
<ul class="org-ul">
<li>IF this node promised to ignore any proposal with this <code>n</code> id, it ignores the message.</li>
<li>IF NOT, it promises to ignore any request with a proposal number lower than <code>n</code>, and replies with <code>promise(n)</code>.  (*)</li>
</ul></li>
</ul>

<p>
<b>Phase 2</b> Proposer has received <code>promise(n)</code> from a majority of acceptors (for some id <code>n</code>).
</p>

<ul class="org-ul">
<li><b>Proposer</b> sends an <code>accept(n, val)</code> to (at least) a majority of acceptors, where <code>n</code> is the id promised in phase 1, and <code>val</code> is the actual value it wants to propose. (**)</li>
<li><b>Acceptor</b> on receiving an <code>accept(n, val)</code> will
<ul class="org-ul">
<li>IF this node promised to ignore any proposal with this <code>n</code>, it ignores the message</li>
<li>IF NOT, replies with <code>accepted(n,val)</code> and also sends that message to all the learners</li>
</ul></li>
</ul>

<p>
Let's look at a simple example:
</p>



<pre class="example">
	     _            __           __           __           __            __
	    |P|          |A1|         |A2|         |A3|         |L1|          |L2|            
	     |            |             |            |            |             |   
  prepare(5) |\----------&gt;|             |            |            |             |
	     | \-----------------------&gt;|            |            |             | 
	     |            |             |            |            |             | 
	     |        ----|prom(5)      |            |            |             |
	     |&lt;------/  ----------------| prom(5)    |            |             | 
	     |&lt;------- /  |             |            |            |             |
	     |            |             |            |            |             | 
	     |            |             |            |            |             | 
milestone 1 ---------------------------------------------------------------------------
	     |            |             |            |            |             |   
accept(5,X)  |\----------&gt;|             |            |            |             |
	     | \-----------------------&gt;|            |            |             | 
	     |        ----|accptd(5,X)  |            |            |             |
	     |&lt;------/    |\            |            |            |             |
	     |            |\---------------------------------------------------&gt;|
	     |            | -------------------------------------&gt;|             |
	     |            |             |            |            |             |   
	     |          ----------------|accptd(5,X) |            |             |   
	     |&lt;--------/  |             |            |            |             |   
	     |            |             |\-------------------------------------&gt;|
	     |            |             |\-----------------------&gt;|             |
	     |            |             |            |            |             | 
	     |            |             |            |            |             | 
milestone 2 ---------------------------------------------------------------------------
	     |            |             |            |            |             | 
	     |            |             |            |            |             | 
	     |            |             |            |            |             | 
	     v            v             v            v            v             v
</pre>
<p>
[Example 16]
</p>

<p>
First, the proposer <code>P</code> sends <code>prepare(5)</code> to a majority of accepters, in this case to <code>A1</code> and <code>A2</code>. Both of them have never promised to reject <code>5</code>, so they respond with <code>promised(5)</code>.
</p>

<p>
At milestone 1, the proposed id <code>n</code> has been accepted by a majority of accepters.
</p>

<p>
Now <code>P</code> can propose a value to agree upon, in this case that value will be <code>X</code>. For this, it sends <code>accept(5, X)</code> to a majority of acceptors. As <code>A1</code> and <code>A2</code> have never promised to reject <code>5</code>, they respond with <code>accepted(5,X)</code>, and they also send this message to learners.
</p>

<p>
At milestone 2, consensus is reached, as a majority af acceptors have accepted a value <code>X</code>. <code>A1</code> and <code>A2</code> still don't know about this, but the proposer does.
</p>

<p>
Milestone 3 happens independently, when each node knows the consensus has been reached about the value <code>X</code>.
</p>


<p>
So far we've seen the simple paxos. We've placed some asterisks in the algorithm description to elaborate more.
</p>

<p>
(*) In the case of phase 1, when an acceptor receives a message <code>promise(n)</code>, and it has NOT promised to ignore than <code>n</code>, then
</p>
<ul class="org-ul">
<li>IF it has previously accepted on something, it replies with <code>promise(n, (n_prev, val_prev))</code></li>
<li>IF NOT, it replies with <code>promise(n)</code></li>
</ul>

<p>
(**) In phase 2, when a proposer has received <code>promise(n)</code> or <code>promise(n, (n_prev, val_prev))</code> from a majority of acceptors (for some id <code>n</code>), then it sends an <code>accept(n, val)</code> to (at least) a majority of acceptors, where <code>n</code> is the id promised in phase 1 and <code>val</code> is the  <code>val_prev</code> that came with the highest id <code>n_prev</code>. If there where none of those messages, then it can propose its own value.
</p>

<p>
The example 16 does not explore these new paths, so let's look at another slighly more complex example, with two proposers. Learners are not drawn, for simplicity.
</p>


<pre class="example">
	     _            __           __            __            __
	    |P1|         |A1|         |A2|          |A3|          |P2|            
	     |            |             |             |            |
  prepare(5) |\----------&gt;|             |             |            |
	     | \-----------------------&gt;|             |            |
	     |            |             |             |            |
	     |        ----|promise(5)   |             |            |
	     |&lt;------/  ----------------| prom(5)     |            |
	     |&lt;------- /  |             |             |            |
	     |            |             |             |            |
	     |            |             |             |            |
	     |            |             |             |            |
accept(5,X)  |\----------&gt;|             |             |            |
	     | \-----------------------&gt;|             |&lt;----------/| prepare(6)
	     |        ----|acceptd(5,X) |             |\         / |
	     |&lt;------/    |&lt;----------------------------\-------/  |
	     |            |             |             |  \--------&gt;| promise(6)
	     |            |             |             |       /    |             
	     |          ----------------|acceptd(5,X) |      /     |             
	     |&lt;--------/  |             |             |     /      |             
	     |            |             |&lt;-----------------/       |   
	     |            |             |             |            |
	     |            |\--------------------------------------&gt;| promise(6,(5,X))
	     |            |             |\------------------------&gt;| promise(6,(5,X))
	     |            |             |             |            |      
	     |            |             |             |            |         
	     |            |             |             |&lt;----------/| accept(6, X)
	     |            |             |&lt;-----------------------/ |
	     |            |             |             |\----------&gt;| accepted(6,X)
	     |            |             |\------------------------&gt;| accepted(6,X)
	     v            v             v            v            v      
</pre>
<p>
[Example 17]
</p>

<p>
In this example, after <code>A1</code> and <code>A2</code> have responded with <code>accepted(5,X)</code> and <code>P1</code> has reached milestone 1, proposer <code>P2</code> starts a new consensus run by sending <code>prepare(6)</code> messages to the three accepters. <code>A3</code> hadn't promissed or accepted anuthing before so it responds with <code>promise(6)</code>.
</p>

<p>
In the case of <code>A1</code> and <code>A2</code>, they had both already accepted the value <code>X</code> for run <code>5</code>, so they respond with <code>promise(6,(5,X)))</code>. When <code>P2</code> receives these messages, it takes the value of the higher previously promised <code>n</code>. In this case they are both 5, so the value chosen will be <code>X</code>.
</p>

<p>
At this point <code>P2</code> starts phase 2 by sending <code>accept(6, X)</code> to a majority of accepters (<code>A1</code>, <code>A2</code> and <code>A3</code>) which respond with <code>accepted</code> messages.
</p>


<p>
<b>Facts about paxos</b>
</p>
<ul class="org-ul">
<li>If a majority of acceptors promise on a number <code>n</code>, no paxos run with value less than <code>n</code> can succeed.</li>
<li>If a majority of acceptors accept on <code>(n, value)</code> then consensus is reached. Consensus is about <code>value</code> an not id <code>n</code>.</li>
<li>If a proposer or a learner gets majority of accepts on a value for a specific <code>n</code>, then they know that consensus has been reached on that value.</li>
</ul>

<p>
<b>Dueling proposers</b>
</p>

<p>
What about the FLP result? Well, the property that paxos fails to guarantee is termination. In example 18 you can see how two proposers can step into each others toes.
</p>


<pre class="example">
	   _            __             __            __            __
	  |P1|         |A1|           |A2|          |A3|          |P2|            
	   |            |               |             |            |
prepare(5) |\----------&gt;|               |             |            |
	   | \-------------------------&gt;|             |            |
	   |            |               |             |            |
	   |        ----|               |             |            |
promise(5) |&lt;------/  ------------------|             |            |
promise(5) |&lt;------- /  |               |             |            |
	   |            |               |             |            |
	   |            |               |             |&lt;----------/| prepare(6)
	   |            |               |             |\         / |
	   |            |               |&lt;--------------\-------/  |
	   |            |               |             |  \--------&gt;| promise(6)
	   |            |               |             |            |     
	   |            |               |\------------------------&gt;| promise(6)
accept(5,A)|\----------&gt;|               |             |            |
	   | \-------------------------&gt;X             |            |
    .      |            |               |             |            |
    .      |        ----|accepted(5,A)  |             |            |
    .      |&lt;------/    |               |             |            |
 TIMEOUT   |            |               |             |            |
prepare(7) |\----------&gt;|               |             |&lt;----------/| accept(6,B)
	   | \-------------------------&gt;|             |\         / |
	   |        ----|               |             | \       /  |
promise(7) |&lt;------/  ------------------|             |  \-----/--&gt;| accepted(6,B)
promise(7) |&lt;------- /  |               |             |       /    |     .
	   |            |               X&lt;-------------------/     |     . 
	   |            |               |             |            |     .
	   |            |               |             |            |  TIMEOUT
	   |            |               |             |&lt;----------/| prepare(8)
	   |            |               |             |\         / |
	   |            |               |&lt;--------------\-------/  |
	   |            |               |             |  \--------&gt;| promise(8)
	   |            |               |             |            |     
	   |            |               |\------------------------&gt;| promise(8)
accept(7,A)|\----------&gt;|               |             |            |
	   | \-------------------------&gt;X             |            |
	   |            |               |             |            |
	   v            v               v             v            v      
</pre>
<p>
[Example 18]
</p>

<p>
In the example, <code>P1</code> starts a consensus run, gets promises on <code>5</code> from <code>A1</code> and <code>A2</code>.<br />
Right after that, and before <code>P1</code> can propose value <code>A</code>, <code>P2</code> starts a consensus run and gets promises on <code>6</code> from <code>A2</code> and <code>A3</code>. This can happen because <code>A2</code> still did not accept anything.<br />
When <code>P1</code> sends the accept messages, <code>A1</code> will respond accepting, but message will be ignored by <code>A2</code>, because <code>A2</code> has just promised on ignoring ids less than <code>6</code>.<br />
Time passes and <code>P1</code> timeouts on waiting for accepted mesage from <code>A2</code>, so it starts a new round. It sends prepare message with an increased id of <code>7</code>, and gets the promises back from <code>A1</code> and <code>A2</code>, as before. <br />
Right after <code>A2</code> promises on rejecting ids less than <code>7</code>, the accept message from proposer <code>P2</code> arrived, and therefore ignored. So <code>P2</code> will also timeout waiting for <code>A2</code>'s response.<br />
This can go on and on forever.
</p>

<p>
So how can we deal with this issue?
</p>

<p>
We can try to mitigate the problem using some heuristics.
</p>

<p>
One possibility is to <i>try</i> to have only one proposer, so dueling never happens. For that, we can elect a leader, using another consensus algorithm. Why another? to use one that guarantees termination. Maybe that other algorithm does not guarantee uniqueness of the leader, but even in that case it reduces the chances of dueling happening, as long as it decides on only one leader most of the time.
</p>

<p>
Another alternative is imposing an exponential backoff pause after timeout, so that eventually one proposer can get its value accepted before the other process proposes a new id.
</p>
</div>


<ul class="org-ul">
