courses/Distributed Systems/distributedSystems.org
**** Multi-paxos

What if we neeed to decide on many values? 
For example, let's say we're deciding on totally order delivery, so each time a message arrives, a consensus run needs to take place. 
An alternative version of the algorithm lets the proposer that won a run on paxos to keep proposing values under the winner id, skipping phase 1. As soon as a new proposers starts a new consensus run under a higher id, that privilege will be taken off him.
But as long as noone else interrupts the sequence, phase 2 can be used.


**** Fault tolerance of paxos

As long as a majority of acceptors do not crash, paxos can go on.
So we want to tolerate f crashes, the we will need 2*f+1 acceptors.

Regarding proposers, we need at least always one.

On the other hand, it works ok under ommision faults.


**** Alternatives to paxos 

- Raft (Diego Ongaro & John Ousterhout, 2014) - Inteded to be easy to understand
- Zab (Zookeeper atomic broadcast) - Yahoo! research
- ViewStamped replication (Brian Oki & Barbara Liskov, 1998)






* Dynamo style DBs

** Passive vs Active replication

Active (State machine replication): Execute each operation in each replica. So what is sent over the network is the operation itself. This is better if the state update is large (multiply each entry by 10).

Passive: Execute the operation in the primary and send updated state to each replica. This is better if the operation is expensive.



** CAP

CAP stands for: Consistency, Availability, Partition tolerance

+ Network partitions :: When a subset of machines cannot talk to another subset.

+ Availability :: Every request receives a response

Primary backup replication chooses a sync replication, where responses to clients are given after receiveing the acknowdlege of each replica. In the case of a netwwork partition, when the client can talk to the primary but primary cannot talk to any replica, the primary won't respond to the client, or respond with an error, compromising availability but protecting consistency.

Dynamo style DBs chooses a different approach. They prioritize availability, while introducing the chance of breaking consistency.

The CAP theorem talks about this. 

+ CAP theorem :: In a scenario where partitions can happen, you cannot have perfect availability and perfect consistency.


** Eventual consistency and strong convergence

Replicas eventually agree, if clients stop sending queries. [Liveness property]

Consistency guarantees are safety properties (FIFO, Strong, RYW, Causal)

There is a safety property than can somehow express strong consistency, and is *Strong convergence*: Replicas that have delivered the same set of updates, have the equivalent state.


#+BEGIN_SRC
a) _            _          _            _
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _x=2__|
   |  \    \--->|          |<----/    / |
   |   \        |    x=1   |         /  |
   |    \----------------->|        /   |
   |            |          |   x=2 /    |
   |            |<----------------/     |
   |            |          |            |
   v            v          v            v
              {x=2}      {x=1}

b) _            _          _            _
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _y=2__|
   |  \    \--->|          |<----/    / |
   |   \        |    x=1   |         /  |
   |    \----------------->|        /   |
   |            |          |   y=2 /    |
   |            |<----------------/     |
   |            |          |            |
   v            v          v            v
            {x=1,y=2}  {x=1,y=2}
#+END_SRC
[Example 19]

Example 19.a violates both strong consistence and strong convergence, while example 19.b only violates strong consistency, while strong convergence is satisfied.

"Strong eventual consistency" is sometimes used to refer to strong convergence + eventual consistency. (A liveness + a safety property)

In the following example we see a possible solution for the issue

#+BEGIN_SRC
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _x=2__|
   |  \    \--->|          |<----/    / |
   |   \        |    x=1   |         /  |
   |    \----------------->|        /   |
   |            |          |   x=2 /    |
   |            |<----------------/     |
   |            |          |            |
   v            v          v            v
            {x=1,2}  {x=2,1}
#+END_SRC
[Example 20]

The replicas will look at the vector clocks of the two updates and realize that they were concurrent, and store both values, so that clients can decide later wich value to keep. By doing this we now have strong convergence.




** Dealing with replicas that disagree

These two concepts are synonims in general, but in the context of the dynamo paper, they mean slightly two different things.

- Anti-entropy :: Resolving conflict in applicatation state (KVS = Application).
- Gossip :: Resolving conflict in view state, meaning, in knowing who's up, who's alive. 

The main difference here is the load. Anti-entropy has to hanle much higher load, as it has to share the whole KV state in each round. For this, it uses merkle trees (aka hash trees).

** Quorum consistency

How many replica responses should clients wait for?

Quorum system let you configure this:

- N :: Number of replicas
- W :: Write quorum
- R :: Read quorum

If we have this setting: N=3, W=3, R=1, it might look similar to primary-backup or chain replication, but the important difference is that in those moedls, clients only talk to one designated replica, while here clients can talk to anyone. So strong consistency is not totally guaranteed.

Dynamo proposes something like: N=3, W=2, R=2. More generally W+R>N, so we know that any read quqrum will intersect with any write quorum.

** Tail latency

Latency at high end of the distribution

