courses/Distributed Systems/distributedSystems.html
<li><a id="org3477837"></a>Multi-paxos<br />
<div class="outline-text-5" id="text-org3477837">
<p>
What if we neeed to decide on many values? 
For example, let's say we're deciding on totally order delivery, so each time a message arrives, a consensus run needs to take place. 
An alternative version of the algorithm lets the proposer that won a run on paxos to keep proposing values under the winner id, skipping phase 1. As soon as a new proposers starts a new consensus run under a higher id, that privilege will be taken off him.
But as long as noone else interrupts the sequence, phase 2 can be used.
</p>
</div>
</li>


<li><a id="org59021ec"></a>Fault tolerance of paxos<br />
<div class="outline-text-5" id="text-org59021ec">
<p>
As long as a majority of acceptors do not crash, paxos can go on.
So we want to tolerate f crashes, the we will need 2*f+1 acceptors.
</p>

<p>
Regarding proposers, we need at least always one.
</p>

<p>
On the other hand, it works ok under ommision faults.
</p>
</div>
</li>


<li><a id="orgb8862d4"></a>Alternatives to paxos<br />
<div class="outline-text-5" id="text-orgb8862d4">
<ul class="org-ul">
<li>Raft (Diego Ongaro &amp; John Ousterhout, 2014) - Inteded to be easy to understand</li>
<li>Zab (Zookeeper atomic broadcast) - Yahoo! research</li>
<li>ViewStamped replication (Brian Oki &amp; Barbara Liskov, 1998)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>






<div id="outline-container-orgc92151d" class="outline-2">
<h2 id="orgc92151d">Dynamo style DBs</h2>
<div class="outline-text-2" id="text-orgc92151d">
</div>
<div id="outline-container-org44064c2" class="outline-3">
<h3 id="org44064c2">Passive vs Active replication</h3>
<div class="outline-text-3" id="text-org44064c2">
<p>
Active (State machine replication): Execute each operation in each replica. So what is sent over the network is the operation itself. This is better if the state update is large (multiply each entry by 10).
</p>

<p>
Passive: Execute the operation in the primary and send updated state to each replica. This is better if the operation is expensive.
</p>
</div>
</div>



<div id="outline-container-org7dc62a0" class="outline-3">
<h3 id="org7dc62a0">CAP</h3>
<div class="outline-text-3" id="text-org7dc62a0">
<p>
CAP stands for: Consistency, Availability, Partition tolerance
</p>

<dl class="org-dl">
<dt>Network partitions</dt><dd>When a subset of machines cannot talk to another subset.</dd>

<dt>Availability</dt><dd>Every request receives a response</dd>
</dl>

<p>
Primary backup replication chooses a sync replication, where responses to clients are given after receiveing the acknowdlege of each replica. In the case of a netwwork partition, when the client can talk to the primary but primary cannot talk to any replica, the primary won't respond to the client, or respond with an error, compromising availability but protecting consistency.
</p>

<p>
Dynamo style DBs chooses a different approach. They prioritize availability, while introducing the chance of breaking consistency.
</p>

<p>
The CAP theorem talks about this. 
</p>

<dl class="org-dl">
<dt>CAP theorem</dt><dd>In a scenario where partitions can happen, you cannot have perfect availability and perfect consistency.</dd>
</dl>
</div>
</div>


<div id="outline-container-org4daceb2" class="outline-3">
<h3 id="org4daceb2">Eventual consistency and strong convergence</h3>
<div class="outline-text-3" id="text-org4daceb2">
<p>
Replicas eventually agree, if clients stop sending queries. [Liveness property]
</p>

<p>
Consistency guarantees are safety properties (FIFO, Strong, RYW, Causal)
</p>

<p>
There is a safety property than can somehow express strong consistency, and is <b>Strong convergence</b>: Replicas that have delivered the same set of updates, have the equivalent state.
</p>


<pre class="example">
a) _            _          _            _
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _x=2__|
   |  \    \---&gt;|          |&lt;----/    / |
   |   \        |    x=1   |         /  |
   |    \-----------------&gt;|        /   |
   |            |          |   x=2 /    |
   |            |&lt;----------------/     |
   |            |          |            |
   v            v          v            v
	      {x=2}      {x=1}

b) _            _          _            _
  |C1|         |R1|       |R2|         |C2|
   |            |          |            |
   |____x=1     |          |      _y=2__|
   |  \    \---&gt;|          |&lt;----/    / |
   |   \        |    x=1   |         /  |
   |    \-----------------&gt;|        /   |
   |            |          |   y=2 /    |
   |            |&lt;----------------/     |
   |            |          |            |
   v            v          v            v
	    {x=1,y=2}  {x=1,y=2}
</pre>
<p>
[Example 19]
</p>

<p>
Example 19.a violates both strong consistence and strong convergence, while example 19.b only violates strong consistency, while strong convergence is satisfied.
</p>

<p>
"Strong eventual consistency" is sometimes used to refer to strong convergence + eventual consistency. (A liveness + a safety property)
</p>

<p>
In the following example we see a possible solution for the issue
</p>

<pre class="example">
|C1|         |R1|       |R2|         |C2|
 |            |          |            |
 |____x=1     |          |      _x=2__|
 |  \    \---&gt;|          |&lt;----/    / |
 |   \        |    x=1   |         /  |
 |    \-----------------&gt;|        /   |
 |            |          |   x=2 /    |
 |            |&lt;----------------/     |
 |            |          |            |
 v            v          v            v
	  {x=1,2}  {x=2,1}
</pre>
<p>
[Example 20]
</p>

<p>
The replicas will look at the vector clocks of the two updates and realize that they were concurrent, and store both values, so that clients can decide later wich value to keep. By doing this we now have strong convergence.
</p>
</div>
</div>




<div id="outline-container-orgbc56626" class="outline-3">
<h3 id="orgbc56626">Dealing with replicas that disagree</h3>
<div class="outline-text-3" id="text-orgbc56626">
<p>
These two concepts are synonims in general, but in the context of the dynamo paper, they mean slightly two different things.
</p>

<dl class="org-dl">
<dt>Anti-entropy</dt><dd>Resolving conflict in applicatation state (KVS = Application).</dd>
<dt>Gossip</dt><dd>Resolving conflict in view state, meaning, in knowing who's up, who's alive.</dd>
</dl>

<p>
The main difference here is the load. Anti-entropy has to hanle much higher load, as it has to share the whole KV state in each round. For this, it uses merkle trees (aka hash trees).
</p>
</div>
</div>

<div id="outline-container-orgc1577a8" class="outline-3">
<h3 id="orgc1577a8">Quorum consistency</h3>
<div class="outline-text-3" id="text-orgc1577a8">
<p>
How many replica responses should clients wait for?
</p>

<p>
Quorum system let you configure this:
</p>

<dl class="org-dl">
<dt>N</dt><dd>Number of replicas</dd>
<dt>W</dt><dd>Write quorum</dd>
<dt>R</dt><dd>Read quorum</dd>
</dl>

<p>
If we have this setting: N=3, W=3, R=1, it might look similar to primary-backup or chain replication, but the important difference is that in those moedls, clients only talk to one designated replica, while here clients can talk to anyone. So strong consistency is not totally guaranteed.
</p>

<p>
Dynamo proposes something like: N=3, W=2, R=2. More generally W+R&gt;N, so we know that any read quqrum will intersect with any write quorum.
</p>
</div>
</div>

<div id="outline-container-org5e3fa57" class="outline-3">
<h3 id="org5e3fa57">Tail latency</h3>
<div class="outline-text-3" id="text-org5e3fa57">
<p>
Latency at high end of the distribution
</p>
</div>
</div>
</div>
