courses/Distributed Systems/distributedSystems.org
* Sharding

What if data does not fit in one machine? Splitting the dataset among multiple nodes is know as /sharding/ or /paritioning/ (not to be confused with network partition).

How do we decide how to split the dataset among the shards? What makes a sharding strategy good?

We would like to avoid hotspots, anddd threfore evenly distribute the load.

+ Partition by key range :: One option is to partition by key. So if keys are string, then shards would be similar to a volume of an encyclopedia. Problem with this is that we end up with an uneven distribution of data (Unless you know it's going to be evenly distributed). 

+ Partition by hash of keys, mod N :: An improved approach involves hashing the keys in order to evenly distribute the key set across machines. So the hashed values can be distributed using ~mod N~ function, where ~N~ is the number of machines. The problem with this approach is that if a machine goes down, or a new machine needs to be added, then the ~N~ changes, and many values will need to be moved to a different machine.

Ideally, if we had ~K~ keys and ~N~ nodes, then ~K/N~ would be the minimum movement possible, taking some keys out of the old machines and move them to the new one. 

+ Consistent hasing :: Let's arrange the hashed key set around a ring, and let's assign machines to a partition of that ring. When a desicion has to happen, the key to be inserted will first be hashed to a value in the ring and the chosen machine will be the one closest, following the ring clockwise.

#+BEGIN_SRC
             0
        _.---+---._
      .'           '. M1
     /             8 \
  M4| 50              |
48  +                 +  16 
    |                 | 
     \            22 /
      '. 38        .'
      M3'-._____.-' M2
             +
             32

M1 stores [50, 8)
M2 stores [8, 22)
M3 stores [22, 38)
M4 stores [38, 50)

#+END_SRC

So in this example, if the key ~k1~ wants to be written, and let's say ~hash(k1)=14~, it will be stored at machine ~M2~

Now let's say a new node needs to be added, and it's added at position 62. The keys that will have to be moved are 
~[50, 62)~, from ~M1~ to the new node ~M5~.

In the case a node crash, its keys will have to be moved to the subsecuent node in the ring. This is why dynamo DB handles replication also using the ring, having a master node for a particular piece of data and choosing backups to the the following nodes in the ring.

+ Consistent hashing with virtual nodes :: A drawback of the consistent hashing algorithm we just described is that the load might not be evenly distributed. This might now always be the case, and it should improve when more and more data is store. Having said this, an improvent would be to hash each machine to many different places in the ring, so that chances of even distribution of the load is higher.

#+BEGIN_SRC
             M4   M3
    M2  _.---+---._
      .'           '. M1
     /               \
  M4|                 |
    +                 +  M2
    |                 | 
   M4\               / M1
      '.           .'
      M3'-._____.-' M2
          M1    M3
#+END_SRC


By using virtual nodes, we can also decide how many virtual nodes each real machine should have, so that load can be sort of customized per machine. So in the case of machine M1 having more space than the rest, we can assign more virtual nodes to it.

* MapReduce

A broad categorization of systems is

+ Online systems :: Services, that wait for clients to make requests, and try to respond as quickly as possible. Low latency and availability is prioritized.

+ Offline systems :: Batch processing systems, where high throuput is often prioritized.

MapReduce comes to help this last group. *MapReduce* is a tool for computing /derived data/. Raw data is the authoritative version of data, the format new data comes in, while derived data is the result of taking this existing data and transforming it somehow.

*** Example: Inverted index.
We can use  MapReduce to compute inverted indexes, as the ones used on search engines. If we have

| Document | Words                              |
|----------+------------------------------------|
|        1 | The, quick, brown, fox, jumps, ... |
|        2 | The, dog, growls                   |
|        3 | My, dog,                           |

And convert it into

| Word   | Document |
|--------+----------|
| The    |     1, 2 |
| quick  |        1 |
| brown  |        1 |
| fox    |        1 |
| jumps  |        1 |
| dog    |     2, 3 |
| growls |        2 |
| My     |        2 |


This computation can be divided into two phases, the /map/ phase, that will convert

(1, [The, quick, brown, fox, jumps]), (2, [The, dog, growls])

into

[(The, 1), (quick, 1), ...], [(The, 2), (dog, 2), ...], [(dog, 3), ...]

And finally a /reduce/ phase that will combine the list of pairs into the final form.

But what is the ral challenge then? Well, if the input is huge, we might want to split the computation into several different machines, parallelizing it. MapReduce structure turns out to be convenient for paralellization.

1. *MAP*: The first phase, the map phase, is completely parallelizable. Each document can be processed by a different machine independently. The results will be stored in each machine local storage.
2. *SHUFFLE*: Then, we need to split the load to each reducer. The default way is to just ~hash(key) mod N~ where ~N~ is the number of reducers. The reduce will now need to read from each local storage to get the intermediate results.
3. *REDUCE*: The reducer will run and write the output to a distributed file system (GFS)

Of course the only thing the programmer needs to care about is the functions provided to the map and reduce phases (and maybe shuffle if they want).

#+begin_src 
map : (K,V) -> [(K', V')]
reduce : (K', [V']) -> [V']
#+end_src

