courses/Distributed Systems/distributedSystems.html

<div id="outline-container-org1494cf2" class="outline-2">
<h2 id="org1494cf2">Sharding</h2>
<div class="outline-text-2" id="text-org1494cf2">
<p>
What if data does not fit in one machine? Splitting the dataset among multiple nodes is know as <i>sharding</i> or <i>paritioning</i> (not to be confused with network partition).
</p>

<p>
How do we decide how to split the dataset among the shards? What makes a sharding strategy good?
</p>

<p>
We would like to avoid hotspots, anddd threfore evenly distribute the load.
</p>

<dl class="org-dl">
<dt>Partition by key range</dt><dd>One option is to partition by key. So if keys are string, then shards would be similar to a volume of an encyclopedia. Problem with this is that we end up with an uneven distribution of data (Unless you know it's going to be evenly distributed).</dd>

<dt>Partition by hash of keys, mod N</dt><dd>An improved approach involves hashing the keys in order to evenly distribute the key set across machines. So the hashed values can be distributed using <code>mod N</code> function, where <code>N</code> is the number of machines. The problem with this approach is that if a machine goes down, or a new machine needs to be added, then the <code>N</code> changes, and many values will need to be moved to a different machine.</dd>
</dl>

<p>
Ideally, if we had <code>K</code> keys and <code>N</code> nodes, then <code>K/N</code> would be the minimum movement possible, taking some keys out of the old machines and move them to the new one. 
</p>

<dl class="org-dl">
<dt>Consistent hasing</dt><dd>Let's arrange the hashed key set around a ring, and let's assign machines to a partition of that ring. When a desicion has to happen, the key to be inserted will first be hashed to a value in the ring and the chosen machine will be the one closest, following the ring clockwise.</dd>
</dl>

<pre class="example">
	     0
	_.---+---._
      .'           '. M1
     /             8 \
  M4| 50              |
48  +                 +  16 
    |                 | 
     \            22 /
      '. 38        .'
      M3'-._____.-' M2
	     +
	     32

M1 stores [50, 8)
M2 stores [8, 22)
M3 stores [22, 38)
M4 stores [38, 50)

</pre>

<p>
So in this example, if the key <code>k1</code> wants to be written, and let's say <code>hash(k1)=14</code>, it will be stored at machine <code>M2</code>
</p>

<p>
Now let's say a new node needs to be added, and it's added at position 62. The keys that will have to be moved are 
<code>[50, 62)</code>, from <code>M1</code> to the new node <code>M5</code>.
</p>

<p>
In the case a node crash, its keys will have to be moved to the subsecuent node in the ring. This is why dynamo DB handles replication also using the ring, having a master node for a particular piece of data and choosing backups to the the following nodes in the ring.
</p>

<dl class="org-dl">
<dt>Consistent hashing with virtual nodes</dt><dd>A drawback of the consistent hashing algorithm we just described is that the load might not be evenly distributed. This might now always be the case, and it should improve when more and more data is store. Having said this, an improvent would be to hash each machine to many different places in the ring, so that chances of even distribution of the load is higher.</dd>
</dl>

<pre class="example">
	   M4   M3
  M2  _.---+---._
    .'           '. M1
   /               \
M4|                 |
  +                 +  M2
  |                 | 
 M4\               / M1
    '.           .'
    M3'-._____.-' M2
	M1    M3
</pre>


<p>
By using virtual nodes, we can also decide how many virtual nodes each real machine should have, so that load can be sort of customized per machine. So in the case of machine M1 having more space than the rest, we can assign more virtual nodes to it.
</p>
</div>
</div>

<div id="outline-container-orgd5d1787" class="outline-2">
<h2 id="orgd5d1787">MapReduce</h2>
<div class="outline-text-2" id="text-orgd5d1787">
<p>
A broad categorization of systems is
</p>

<dl class="org-dl">
<dt>Online systems</dt><dd>Services, that wait for clients to make requests, and try to respond as quickly as possible. Low latency and availability is prioritized.</dd>

<dt>Offline systems</dt><dd>Batch processing systems, where high throuput is often prioritized.</dd>
</dl>

<p>
MapReduce comes to help this last group. <b>MapReduce</b> is a tool for computing <i>derived data</i>. Raw data is the authoritative version of data, the format new data comes in, while derived data is the result of taking this existing data and transforming it somehow.
</p>
</div>

<div id="outline-container-org8ca00b3" class="outline-4">
<h4 id="org8ca00b3">Example: Inverted index.</h4>
<div class="outline-text-4" id="text-org8ca00b3">
<p>
We can use  MapReduce to compute inverted indexes, as the ones used on search engines. If we have
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Document</th>
<th scope="col" class="org-left">Words</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">The, quick, brown, fox, jumps, &#x2026;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">The, dog, growls</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">My, dog,</td>
</tr>
</tbody>
</table>

<p>
And convert it into
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Word</th>
<th scope="col" class="org-right">Document</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">The</td>
<td class="org-right">1, 2</td>
</tr>

<tr>
<td class="org-left">quick</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">brown</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">fox</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">jumps</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">dog</td>
<td class="org-right">2, 3</td>
</tr>

<tr>
<td class="org-left">growls</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">My</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>


<p>
This computation can be divided into two phases, the <i>map</i> phase, that will convert
</p>

<p>
(1, [The, quick, brown, fox, jumps]), (2, [The, dog, growls])
</p>

<p>
into
</p>

<p>
[(The, 1), (quick, 1), &#x2026;], [(The, 2), (dog, 2), &#x2026;], [(dog, 3), &#x2026;]
</p>

<p>
And finally a <i>reduce</i> phase that will combine the list of pairs into the final form.
</p>

<p>
But what is the ral challenge then? Well, if the input is huge, we might want to split the computation into several different machines, parallelizing it. MapReduce structure turns out to be convenient for paralellization.
</p>

<ol class="org-ol">
<li><b>MAP</b>: The first phase, the map phase, is completely parallelizable. Each document can be processed by a different machine independently. The results will be stored in each machine local storage.</li>
<li><b>SHUFFLE</b>: Then, we need to split the load to each reducer. The default way is to just <code>hash(key) mod N</code> where <code>N</code> is the number of reducers. The reduce will now need to read from each local storage to get the intermediate results.</li>
<li><b>REDUCE</b>: The reducer will run and write the output to a distributed file system (GFS)</li>
</ol>

<p>
Of course the only thing the programmer needs to care about is the functions provided to the map and reduce phases (and maybe shuffle if they want).
</p>

<pre class="example">
map : (K,V) -&gt; [(K', V')]
reduce : (K', [V']) -&gt; [V']
</pre>
</div>
</div>
</div>
